{
  "common": {
    "name": "autodarts",
    "version": "1.0.1",
    "news": {
      "1.0.1": {
        "en": "Enhanced: Updated all Node.js built-in module imports to use 'node:' prefix format for better clarity and security\nFixed: Changlog error at readme.md\nImproved: FAQ because of the new structure\nFixed: State roles now comply with ioBroker standards - config states use `level.*` roles, read-only color uses `text` role",
        "de": "Verbessert: Aktualisiert alle Node.js-Einbau-Modulimporte, um 'node:' Präfix-Format für bessere Klarheit und Sicherheit\nBehoben: Changlog-Fehler bei readme. md\nVerbessert: FAQ wegen der neuen Struktur\nBehoben: Die staatlichen Rollen entsprechen jetzt ioBroker Standards - config Staaten verwenden `level.* ` Rollen, Nur lesen Farbe verwendet `text` Rolle",
        "ru": "Улучшено: Обновлен весь импорт встроенных модулей Node.js для использования формата префикса «узел:» для большей ясности и безопасности\nИсправлено: ошибка Changlog в readme. мд\nУлучшенный: FAQ из-за новой структуры\nИсправлено: государственные роли теперь соответствуют стандартам ioBroker - конфигурационные состояния используют роли «уровня»",
        "pt": "Melhorado: Updated all Node.js built-in module importations to use 'node:' prefixo format for better clear and security\nCorrigido: Changlog erro no readme. md\nMelhorado: FAQ por causa da nova estrutura\nFixado: As funções do estado agora cumprem com os padrões do ioBroker - os estados de configuração usam as funções `level.*', a cor somente para leitura usa a função `text'",
        "nl": "Verbeterd: Bijgewerkt alle Node.js ingebouwde module import om 'node:' prefix formaat te gebruiken voor meer duidelijkheid en veiligheid\nFixed: Changlog fout bij readme. md\nVerbeterd: FAQ vanwege de nieuwe structuur\nFixed: State rollen nu voldoen aan joBroker normen - config states maken gebruik van ",
        "fr": "Amélioration : Mise à jour de toutes les importations de modules intégrés Node.js pour utiliser le format préfixe 'node:' pour une meilleure clarté et sécurité\nCorrection : erreur Changlog à la lecture. md\nAmélioration : FAQ en raison de la nouvelle structure\nCorrection : les rôles de l'État sont désormais conformes aux normes ioBroker - les États de configuration utilisent les rôles `level.*`, la couleur en lecture seule utilise le rôle `text`",
        "it": "Migliorato: Aggiornato tutte le importazioni del modulo incorporato Node.js per usare il formato 'nodo:' prefisso per una migliore chiarezza e sicurezza\nRisolto: Errore Changlog a readme. M\nMigliorato: FAQ a causa della nuova struttura\nRisolto: i ruoli di stato sono ora conformi agli standard ioBroker - gli stati di configurazione usano i ruoli `level.*`, il colore di sola lettura utilizza il ruolo `text`",
        "es": "Mejorado: Actualizado todas las importaciones de módulos integrados Node.js para utilizar 'node:' formato prefijo para una mejor claridad y seguridad\nCorregido: Error de Changlog en readme. md\nMejorado: FAQ debido a la nueva estructura\nCorregido: Los papeles del Estado cumplen ahora con las normas de yoBroker - los estados de config utilizan roles de 'nivel.*`, sólo el color de lectura utiliza 'texto' papel",
        "pl": "Wzmocnione: Aktualizacja wszystkich Node.js built- w imporcie modułu do użycia 'node:' format prefix dla większej jasności i bezpieczeństwa\nNaprawiono: błąd Changlog przy readme. md\nUlepszone: FAQ ze względu na nową strukturę\nStała: Role stanu są teraz zgodne ze standardami jOBrokera - stany konfiguracyjne używają 'level. *' roles, kolor tylko read- wykorzystuje 'text' role",
        "uk": "Підвищений: Оновлено всі імпорт модуля Node.js для використання 'node:' prefix формат для кращої чіткості та безпеки\nВиправлено: Похибка Changlog на readme. мд\nПокращується: FAQ через нову структуру\nВиправлено: Державні ролі тепер відповідають нормам ioBroker - конфігураційні стани використовують `level.*`````````````````text```",
        "zh-cn": "增强: 更新所有节点.js内置模块导入以使用“ 节点:” 前缀格式以提高清晰度和安全性\n固定: 朗洛格在readme错误. 微额\n改进:因新结构而提出问题\n固定:国家角色现在符合ioBroker标准 - 配置状态使用“级别”。 角色,只读颜色使用“文本”角色"
      },
      "1.0.0": {
        "en": "BREAKING CHANGE: All triggers to unified trigger.is structure\nManual cleanup required: Delete old autodarts.X.throw.is and tools. states after update\nUnchanged: tools.RAW, tools.config.url, all timers/functionality",
        "de": "BREAKING CHANGE: Alle Auslöser zum vereinheitlichten Auslöser. ist Struktur\nManuelle Reinigung erforderlich: Löschen Sie alte Autodarts. X.throw.is und Werkzeuge. Zustände nach Update\nUnverändert: Werkzeuge. RAW, tools.config.url, alle Timer/Funktionalität",
        "ru": "Изменить дыхание: Все триггеры в единый триггер. структура\nТребуется ручная очистка: Удалите старые автодарты. X.throw.is и инструменты. государства после обновления\nБез изменений: инструменты. RAW, tools.config.url, все таймеры/функциональность",
        "pt": "MUDANÇAS DE RISCO: Todos os gatilhos para o gatilho unificado. é estrutura\nLimpeza manual necessária: Apagar os autodarts antigos. X.throw.is e ferramentas. estados após a atualização\nInalterado: ferramentas. RAW, tools.config.url, todos os timers/funcionalidade",
        "nl": "Breaking VERANDERING: Alle triggers naar uniforme trekker. is structuur\nHandmatig opruimen vereist: Verwijder oude autodarts. X.throw.is en gereedschap. staat na update\nOngewijzigd: gereedschap. RAW, tools.config.url, all timers/functionaliteit",
        "fr": "CHANGEMENT DE BREAING: Tous les déclencheurs au déclencheur unifié. est la structure\nNettoyage manuel requis: Supprimer les anciens autodarts. X.throw. est et outils. États après mise à jour\nSans changement : outils. RAW, tools.config.url, toutes les minuteries/fonctionnalité",
        "it": "CAMBIO DI BREAKING: Tutti i trigger per attivare unificato. è struttura\nPulizia manuale necessaria: Eliminare vecchi autodarts. X.throw.is e strumenti. stati dopo l'aggiornamento\nSvariato: strumenti. RAW, tools.config.url, tutti i timer/funzionalità",
        "es": "Cambiando: Todos disparan al gatillo unificado. estructura\nLimpieza manual requerida: Eliminar viejos autodarts. X.throw.is y herramientas. estados después de la actualización\nSin cambios: herramientas. RAW, tools.config.url, todos los temporizadores/funcionalidad",
        "pl": "ZMIANA ZBIORCZA: Wszystkie wyzwalacze do jednego zapalnika. jest strukturą\nWymagane jest ręczne czyszczenie: Usuń stare autodoty. X.throw.is i narzędzia. stany po aktualizacji\nBez zmian: narzędzia. RAW, narzędzia .config.url, wszystkie timery / funkcjonalność",
        "uk": "БРЕАКІНГ ЗМІН: Всі тригери для уніфікованого тригера. структура\nВимоги: Видалити старі автодарти. X.throw.is та інструменти. стани після оновлення\nНезмінені: інструменти. RAW, інструменти.config.url, всі таймери/функціональність",
        "zh-cn": "打破变化: 所有触发器统一触发. 是结构\n需要进行人工清理: 删除旧的自定义 。 X. throw.is和工具。 更新后状态\n未更改:工具。 RAW,工具.config.url,所有计时器/功能"
      },
      "0.8.3": {
        "en": "Added: CHANGELOG_OLD.md\nImproved: Link to documentation added to the help section.",
        "de": "Hinzugefügt: CHANGELOG_OLD.md\nVerbessert: Link zur Dokumentation, die im Hilfebereich hinzugefügt wird.",
        "ru": "Добавлено: CHANGELOG_OLD.md\nУлучшено: Ссылка на документацию, добавленную в раздел справки.",
        "pt": "Adicionado: MUDANÇA_OLD.md\nMelhorado: Link para documentação adicionada à seção de ajuda.",
        "nl": "Toegevoegd: VERANDERINGLOG_OLD.md\nVerbeterd: Link naar documentatie toegevoegd aan de help sectie.",
        "fr": "Ajouté : CHANGELOG_OLD.md\nAmélioration : Lien vers la documentation ajoutée à la section d'aide.",
        "it": "Aggiunto: CHANGELOG_OLD.md\nMigliorato: Link alla documentazione aggiunta alla sezione di aiuto.",
        "es": "Añadido: CHANGELOG_OLD.md\nMejorado: Enlace a la documentación agregada a la sección de ayuda.",
        "pl": "Dodano: CHANGELOG _ OLD.md\nUlepszone: Link do dokumentacji dodanej do sekcji pomocy.",
        "uk": "Доданий: CHANGELOG_OLD.md\nУдосконалено: Посилання на документацію, додану до розділу допомоги.",
        "zh-cn": "添加:变换组_OLD.md\n改进:与帮助部分新增的文件链接."
      },
      "0.8.2": {
        "en": "Fixed: ImageURL",
        "de": "Behoben: ImageURL",
        "ru": "Выпущено: ImageURL",
        "pt": "Fixo: ImageURL",
        "nl": "Vast: ImageURL",
        "fr": "Correction : ImageURL",
        "it": "Fisso: ImageURL",
        "es": "Fijo: ImageURL",
        "pl": "Naprawiono: ImageURL",
        "uk": "Виправлено: Зображення",
        "zh-cn": "固定: 图像URL"
      },
      "0.8.1": {
        "en": "Added: New DE/EN adapter documentation under `/docs` with separate pages for all config tabs (Options, Mappings, Tools addon integration, Help & FAQ).\nImproved: Main README cleaned up and linked to the new documentation (badges, feature overview, configuration section).\nImproved: Clarified Tools addon integration flow (Simple-API requirements, generated URLs, WLED usage).",
        "de": "Hinzugefügt: Neue DE/EN-Adapterdokumentation unter `/docs` mit separaten Seiten für alle Config-Tabs (Optionen, Mappings, Tools Addon Integration, Help & FAQ).\nVerbessert: Haupt-README gereinigt und mit der neuen Dokumentation verknüpft (Badges, Funktionsübersicht, Konfigurationsabschnitt).\nVerbessert: Clarified Tools Addon Integration Flow (Simple-API Anforderungen, generierte URLs, WLED-Nutzung).",
        "ru": "Добавлена: новая адаптерная документация DE/EN в разделе «/docs» с отдельными страницами для всех вкладок конфигураций (Options, Mappings, Tools addon integration, Help & FAQ).\nУлучшенный: основной README очищен и связан с новой документацией (знаки, обзор функций, раздел конфигурации).\nУлучшенный: поток интеграции дополнений Clarified Tools (простые требования API, генерируемые URL-адреса, использование WLED).",
        "pt": "Adicionado: Nova documentação do adaptador DE/EN sob `/docs` com páginas separadas para todas as abas de configuração (Opções, Mapeamentos, Integração addon de Ferramentas, Ajuda e FAQ).\nMelhorado: Principal README limpou e vinculado à nova documentação (falhas, visão geral do recurso, seção de configuração).\nMelhorado: Fluxo de integração addon de Ferramentas Clarificadas (Requisitos API simples, URLs geradas, uso WLED).",
        "nl": "Toegevoegd: Nieuwe DE/EN-adapterdocumentatie onder .\nVerbeterd: Main README opgeruimd en gekoppeld aan de nieuwe documentatie (badges, functie overzicht, configuratie sectie).\nVerbeterd: Clarified Tools addon integration flow (Simple-API eisen, gegenereerde URL's, WLED gebruik).",
        "fr": "Ajouté: Nouvelle documentation d'adaptateur DE/EN sous `/docs` avec des pages séparées pour tous les onglets de configuration (Options, Mappings, Outils d'intégration, Aide & FAQ).\nAmélioration: Main README nettoyé et relié à la nouvelle documentation (mauvaises, aperçu des fonctionnalités, section de configuration).\nAmélioration : flux d'intégration addon d'outils clarifiés (exigences Simple-API, URL générée, utilisation WLED).",
        "it": "Aggiunto: Nuova documentazione dell'adattatore DE/EN sotto `/docs` con pagine separate per tutte le schede di configurazione (Options, Mappings, Tools addon integration, Help & FAQ).\nMigliorato: README principale ripulito e collegato alla nuova documentazione (cattivi, panoramica delle caratteristiche, sezione configurazione).\nMigliorato: Clarified Tools addon integration flow (requisiti Simple-API, URL generati, utilizzo WLED).",
        "es": "Añadido: Nueva documentación de adaptador DE/EN bajo `/docs` con páginas separadas para todas las pestañas de configuración (Opciones, Mappings, integración de herramientas addon, Ayuda > FAQ).\nMejorado: El README principal se limpió y se vinculó con la nueva documentación (badges, descripción de características, sección de configuración).\nMejorado: Flujo de integración de Herramientas Aclaradas (requisitos Simple-API, URLs generadas, uso WLED).",
        "pl": "Dodano: Nowa dokumentacja adaptera DE / EN pod '/ docs' z osobnymi stronami dla wszystkich kart konfiguracyjnych (Opcje, Mappings, Narzędzia integracji addon, Pomoc & FAQ).\nUlepszony: Główny README wyczyścił i podłączony do nowej dokumentacji (odznaki, przegląd funkcji, sekcja konfiguracji).\nUlepszone: Klarowne narzędzia przepływu integracji addon (wymagania Simplemen- API, generowane adresy URL, wykorzystanie WLED).",
        "uk": "Додано: Нова документація адаптера DE/EN під `/docs` з окремими сторінками для всіх вкладок налаштувань (Options, Mappings, Tools addon інтеграції, Допомога & FAQ).\nУдосконалено: Головне ОБМЕЖЕННЕ очищення та пов’язане з новою документацією (податки, огляд функцій, розділ конфігурації).\nУдосконалено: Уточнено інтеграційний потік кларатифікованих інструментів (для вимог АПІ, створених URL-адрес, використання WLED).",
        "zh-cn": "添加: \" /docs \" 下新的DE/EN适配文件,所有配置标签(选项、绘图、工具添加集成、帮助和FAQ)都有单独的网页.\n改进:主要README清理并连接到新的文档(栏目,特征概述,配置部分).\n改进:claized Tools addon集成流(Simple-API要求,生成URL,WLED使用)."
      },
      "0.8.0": {
        "en": "Added: New **TOOLS ADDON INTEGRATION** tab and runtime-generated URL states under `tools.config.*` for browser-based integrations (e.g. Tools for Autodarts).",
        "de": "Hinzugefügt: Neue **TOOLS ADDON INTEGRATION** und Runtime-generierte URL-Staaten unter `tools.config.* für Browser-basierte Integrationen (z.B. Tools for Autodarts).",
        "ru": "Добавлено: новая вкладка **TOOLS ADDON INTEGRATION** и URL-адреса, генерируемые во время выполнения, в разделе «tools.config.*» для интеграций на основе браузера (например, Tools for Autodarts).",
        "pt": "Adicionado: Novo **TOOLS ADDON INTEGRATION** aba e estados de URL gerados em tempo de execução em `tools.config.*` para integrações baseadas em navegador (por exemplo, Ferramentas para Autodarts).",
        "nl": "Toegevoegd: Nieuwe **TOOLS ADDON INTEGRATION** tabblad en runtime-gegenereerde URL-toestanden onder .",
        "fr": "Ajouté : nouvel onglet **TOOLS ADDON INTEGRATION** et états d'URL générés par l'exécution sous `tools.config.*` pour les intégrations basées sur le navigateur (par exemple Outils pour Autodarts).",
        "it": "Aggiunto: New **TOOLS ADDON INTEGRATION** tab and runtime-generated URL stati sotto `tools.config.*` per le integrazioni basate sul browser (ad esempio Strumenti per Autodarts).",
        "es": "Añadido: Nuevo **TOOLS ADDON INTEGRATION** pestaña y estados URL generados por tiempo de ejecución bajo `tools.config.*` para integraciones basadas en el navegador (por ejemplo, Herramientas para Autodarts).",
        "pl": "Dodano: New ** TOOLS ADDON INTEGRATION* * tab and runtime- genered URL states under 'tools.config.*' for browser- based integrations (np. Tools for Autodarts). ",
        "uk": "Додано: New **TOOLS ADDON INTEGRATION*** вкладка та пускові дегенеровані стани URL під `tools.config.*` для інтеграції браузера (наприклад, Інструменти для Autodarts).",
        "zh-cn": "添加:在“tools.config.QQ”下新建 **TOOLS ADDON INTEGINation**标签和运行时间生成的URL状态,用于基于浏览器的集成(例如,用于自动化的工具)."
      },
      "0.7.3": {
        "en": "Fix Adapter Checker Warnings",
        "de": "Fix Adapter Checker Warnungen",
        "ru": "Fix Adapter Checker Предупреждения",
        "pt": "Corrigir avisos de verificação do adaptador",
        "nl": "Waarschuwingen voor adaptercontrole herstellen",
        "fr": "Correction des avertissements du vérificateur d'adaptateur",
        "it": "Risolvere le avvertenze dell'adattatore",
        "es": "Advertencias de adaptador de fijación",
        "pl": "Napraw ostrzeżenia dotyczące kontroli adaptera",
        "uk": "Перевірити попередження адаптера",
        "zh-cn": "修正适配器检查器警告"
      }
    },
    "titleLang": {
      "en": "Autodarts Integration",
      "de": "Autodarts-Integration",
      "ru": "Интеграция Autodarts",
      "pt": "Integração com Autodarts",
      "nl": "AutoDART-integratie",
      "fr": "Intégration d'Autodarts",
      "it": "Integrazione Autodarts",
      "es": "Integración de Autodarts",
      "pl": "Integracja Autodarts",
      "uk": "Інтеграція з AutoDarts",
      "zh-cn": "Autodarts 集成"
    },
    "desc": {
      "en": "Connects the ioBroker to the local Autodarts Board Manager.\n\nProvides states and events for the current game, allowing to trigger lights, sounds, text-to-speech, or other automations.",
      "de": "Verbindet den ioBroker mit dem lokalen Autodarts Board Manager.\n\nBietet Zustände und Ereignisse für das aktuelle Spiel, wodurch Lichter, Töne, Text-zu-Sprache oder andere Automatisierungen ausgelöst werden können.",
      "ru": "Обеспечивает связь ioBroker с локальным менеджером досок Autodarts.\n\nПредоставляет состояния и события для текущей игры, позволяя запускать световые эффекты, звуки, преобразование текста в речь или другие автоматизированные действия.",
      "pt": "Conecta o ioBroker ao Gerenciador de Tabuleiro Autodarts local.\n\nFornece estados e eventos para o jogo atual, permitindo acionar luzes, sons, conversão de texto em fala ou outras automações.",
      "nl": "Verbindt de ioBroker met de lokale Autodarts Board Manager.\n\nBiedt statussen en gebeurtenissen voor het huidige spel, waardoor het mogelijk is om lichten, geluiden, tekst-naar-spraak of andere automatiseringen te activeren.",
      "fr": "Connecte l'ioBroker au gestionnaire de plateau Autodarts local.\n\nFournit les états et les événements du jeu en cours, permettant de déclencher des lumières, des sons, la synthèse vocale ou d'autres automatisations.",
      "it": "Collega ioBroker al gestore locale del tabellone Autodarts.\n\nFornisce stati ed eventi per il gioco in corso, consentendo di attivare luci, suoni, sintesi vocale o altre automazioni.",
      "es": "Conecta el ioBroker al administrador de tablero Autodarts local.\n\nProporciona estados y eventos para el juego actual, lo que permite activar luces, sonidos, texto a voz u otras automatizaciones.",
      "pl": "Łączy ioBroker z lokalnym menadżerem płyt Autodarts.\n\nZawiera stany i zdarzenia dla bieżącej gry, umożliwiając aktywację świateł, dźwięków, zamiany tekstu na mowę lub innych automatyzacji.",
      "uk": "Підключає ioBroker до локального менеджера дошки Autodarts.\n\nНадає стани та події для поточної гри, дозволяючи запускати світло, звуки, перетворення тексту в мовлення або інші автоматизації.",
      "zh-cn": "将 ioBroker 连接到本地 Autodarts 棋盘管理器。\n\n为当前游戏提供状态和事件，允许触发灯光、声音、文本转语音或其他自动化功能。"
    },
    "authors": [
      "skvarel <skvarel@inventwo.com>"
    ],
    "keywords": [
      "dart",
      "scoring",
      "game",
      "automations",
      "autodarts"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "autodarts.svg",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.autodarts/main/admin/autodarts.svg",
    "enabled": true,
    "loglevel": "info",
    "mode": "daemon",
    "tier": 3,
    "type": "protocols",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "host": "127.0.0.1",
    "port": 3180,
    "intervalSec": 1,
    "triggerResetSec": 0,
    "tripleMinScore": 1,
    "tripleMaxScore": 20,
    "lightTargetId": "",
    "powerTargetId": "",
    "toolsIp": "",
    "toolsPort": 8087,
    "toolsInstance": 0,
    "toolsUrlBusted": "",
    "toolsUrlGameon": "",
    "toolsUrlGameshot": ""
  },
  "objects": [],
  "instanceObjects": []
}
