{
  "common": {
    "name": "autodarts",
    "version": "0.6.0",
    "news": {
      "0.6.0": {
        "en": "Added: New throw.isMiss state to detect and trigger automations on missed darts (including auto-reset via triggerResetSec).\nAdded: New throw.isDouble state to detect and trigger automations on double segments (including auto-reset via triggerResetSec).",
        "de": "Hinzugefügt: Neue Wurf. isMiss-Zustand zu erkennen und Automatisierungen auf verpassten Darts auszulösen (einschließlich Auto-Reset über triggerResetSec).\nHinzugefügt: Neue Wurf. ist doppelter Zustand, um Automatisierungen auf Doppelsegmenten zu erkennen und auszulösen (einschließlich Auto-Reset über triggerResetSec).",
        "ru": "Добавлено: Новый бросок. состояние Мисс для обнаружения и запуска автоматизации на пропущенных дротиках (включая автоматическое сброс через триггерResetSec).\nДобавлено: Новый бросок. Двойное состояние для обнаружения и запуска автоматизации в двойных сегментах (включая автоперезагрузку через триггерResetSec).",
        "pt": "Adicionado: Novo lançamento. isMiss estado para detectar e ativar automações em dardos perdidos (incluindo auto-reset via triggerResetSec).\nAdicionado: Novo lançamento. isDouble state to detect and active automations in double segments (incluindo auto-reset via triggerResetSec).",
        "nl": "Toegevoegd: Nieuwe worp. isMiss staat te detecteren en te triggeren automatisering op gemiste darts (inclusief auto-reset via triggerResetSec).\nToegevoegd: Nieuwe worp. isDubbele toestand te detecteren en te triggeren automatiseringen op dubbele segmenten (inclusief auto-reset via triggerResetSec).",
        "fr": "Ajouté : Nouveau lancer. isMiss state pour détecter et déclencher les automatismes sur les fléchettes oubliées (y compris auto-reset via triggerResetSec).\nAjouté : Nouveau lancer. est l'état double pour détecter et déclencher les automatismes sur les doubles segments (y compris auto-reset via triggerResetSec).",
        "it": "Aggiunto: Nuovo tiro. isMiss stato per rilevare e attivare le automazioni sulle freccette mancate (compreso il ripristino automatico tramite triggerResetSec).\nAggiunto: Nuovo tiro. isDouble state per rilevare e attivare le automazioni su due segmenti (compreso il ripristino automatico tramite triggerResetSec).",
        "es": "Añadido: Nuevo lanzamiento. isMiss state para detectar y desencadenar automatizaciones en dardos perdidos (incluyendo el ajuste automático a través de triggerResetSec).\nAñadido: Nuevo lanzamiento. isDoble estado para detectar y desencadenar automatizaciones en segmentos dobles (incluyendo el ajuste automático a través de triggerResetSec).",
        "pl": "Dodano: nowy rzut. isMiss stan do wykrywania i uruchamiania automatyzacji na nieodebranych rzutki (w tym auto- reset poprzez triggerResetSec).\nDodano: nowy rzut. isDouble state do wykrywania i uruchamiania automatyzacji na podwójnych segmentach (w tym auto- reset poprzez triggerResetSec).",
        "uk": "Доданий: Новий кицька. isMiss держава для виявлення та запуску автоматизації на пропущених darts (включаючи автозавантаження через тригерResetSec).\nДоданий: Новий кицька. єподвійним станом для виявлення та запуску автоматизації на подвійних сегментах (включаючи автозавантаження через тригерResetSec).",
        "zh-cn": "添加:新掷. 是Miss State,用于检测和触发对丢失的飞镖的自动化(包括通过触发器ResetSec自动重置).\n添加:新掷. isDouble状态在双片段上检测和触发自动化(包括通过触发ResetSec自动重置)."
      },
      "0.5.1": {
        "en": "Fixed: Hardware light/power mapping now respects configured target IDs and works on all systems.",
        "de": "Behoben: Hardware-Licht/Strom-Mapping respektiert nun konfigurierte Ziel-IDs und arbeitet an allen Systemen.",
        "ru": "Фиксированный: аппаратное отображение света/мощности теперь учитывает настроенные идентификаторы цели и работает на всех системах.",
        "pt": "Fixo: O mapeamento de luz/potência de hardware agora respeita IDs de destino configurados e funciona em todos os sistemas.",
        "nl": "Vast: Hardware licht/kracht mapping respecteert nu geconfigureerde doel ID's en werkt op alle systemen.",
        "fr": "Correction : La cartographie matérielle de la lumière/puissance respecte désormais les identifiants de cible configurés et fonctionne sur tous les systèmes.",
        "it": "Risolto: la mappatura della luce/potenza hardware ora rispetta gli ID di destinazione configurati e funziona su tutti i sistemi.",
        "es": "Fijo: Hardware light/power mapping respeta ahora los IDs de destino configurados y funciona en todos los sistemas.",
        "pl": "Naprawiono: Hardware light / Power mapowanie teraz szanuje skonfigurowane identyfikatory docelowe i działa na wszystkich systemach.",
        "uk": "Виправлено: Апаратне освітлення / живлення тепер поважає налаштовувати цільові ідентифікатори і працює на всіх системах.",
        "zh-cn": "固定:硬件光电映射现在尊重已配置的目标ID,并在所有系统中工作."
      },
      "0.5.0": {
        "en": "Added: Bidirectional hardware control states `system.hardware.light` and `system.hardware.power`\nAdded: Configuration options to map light/power states to external ioBroker states (e.g., 0_userdata)\nChanged: Hardware states now support read/write operations for full automation integration",
        "de": "Hinzugefügt: Bidirektionale Hardware-Steuerzustände `system.hardware.light` und `system.hardware.power `\nHinzugefügt: Konfigurationsoptionen zur Abbildung von Licht/Leistungszuständen zu externen ioBroker Zuständen (z.B. 0_userdata)\nGeändert: Hardware-Staaten unterstützen nun Lese- und Schreibvorgänge für die vollständige Automatisierungsintegration",
        "ru": "Добавлено: Двунаправленное аппаратное управление состояниями «system.hardware.light» и «system.hardware.power» пункт\nДобавлено: Варианты конфигурации для отображения состояний света/мощности на внешние состояния ioBroker (например, 0_userdata)\nИзменены: штаты оборудования теперь поддерживают операции чтения / записи для полной интеграции автоматизации",
        "pt": "Adicionado: estados de controle de hardware bidirecional `system.hardware.light' e `system.hardware.power `\nAdicionado: Opções de configuração para mapear estados de luz/poder para estados de ioBroker externos (por exemplo, 0_userdata)\nModificado: Os estados de hardware agora suportam operações de leitura/escrita para integração completa de automação",
        "nl": "Toegevoegd: Bidirectionele hardware-besturing staat voor  Wat\nToegevoegd: Configuratie-opties voor het in kaart brengen van licht/krachttoestanden naar externe ioBroker-toestanden (bijv. 0_userdata)\nGewijzigd: Hardware toestanden ondersteunen nu lezen/schrijven bewerkingen voor volledige automatisering integratie",
        "fr": "Ajouté : Les états de contrôle du matériel bidirectionnel `system.hardware.light` et `system.hardware.power \"\nAjouté: Options de configuration pour cartographier les états de lumière/puissance vers les états externes ioBroker (par exemple, 0_userdata)\nChanged: Les états matériels prennent désormais en charge les opérations de lecture/écriture pour l'intégration complète de l'automatisation",
        "it": "Aggiunto: Bidirectional hardware control stati `system.hardware.light` e `system.hardware.power #\nAggiunto: Opzioni di configurazione per mappare gli stati di luce/potenza agli stati ioBroker esterni (ad esempio, 0_userdata)\nCambiato: gli stati hardware ora supportano le operazioni di lettura/scrittura per l'integrazione completa dell'automazione",
        "es": "Añadido: Bidirectional hardware control states `system.hardware.light` y `system.hardware.power `\nAñadido: Opciones de configuración para mapear estados de luz/poder a estados de yoBroker externos (por ejemplo, 0_userdata)\nCambio: Los estados de Hardware ahora apoyan operaciones de lectura/escritura para la integración de la automatización completa",
        "pl": "Dodano: dwukierunkowa kontrola sprzętowa stanów 'system.hardware.light' i 'system.hardware.power'\nDodano: Opcje konfiguracji do mapowania stanów światła / mocy do zewnętrznych stanów jOBroker (np. 0 _ userdata)\nZmiana: Stan sprzętu obsługuje teraz operacje odczytu / zapisu dla pełnej automatyzacji integracji",
        "uk": "Додано: Двосторонні стани керування обладнанням `system.hardware.light` і `system.hardware.power й\nДодано: Параметри конфігурації для мапи світло/потужних станів на зовнішні стани ioBroker (наприклад, 0_userdata)\nЗмінено: Апаратні стани, які зараз підтримують операції читання/запису для повної інтеграції автоматизації",
        "zh-cn": "添加:双向硬件控制状态为‘system.hardware.light'和‘system.hardware.power. `\n添加: 将光/ 电状态映射到外部 ioBroker 状态的配置选项( 如 0_ userdata)\n更改: 硬件状态现在支持读/写操作,以便完全自动化集成"
      },
      "0.4.0": {
        "en": "Changed: Restructured system information into dedicated `system.hardware`, `system.software` and `system.cams` channels.\nAdded: New software info states (`desktopVersion`, `boardVersion`, `platform`, `os`) and hardware info states (`kernelArch`, `cpuModel`, `hostname`).\nAdded: Camera configuration states `system.cams.cam0/1/2` containing JSON with width, height and fps.\nChanged: Adapter configuration for polling interval and triple trigger thresholds is now fully driven via jsonConfig (dropdowns and number fields).\nRemoved: Experimental light/power alias mapping from internal logic (no user-visible feature was released).",
        "de": "Geändert: Restrukturierte Systeminformationen in dedizierte `system.hardware`, `system.software` und `system.cams` Kanäle.\nHinzugefügt: Neue Software-Info-Zustände (`desktopVersion`, `boardVersion`, `platform`, `os`) und Hardware-Info-Zustände (`kernelArch`, `cpuModel`, `hostname`).\nHinzugefügt: Kamera-Konfigurationszustände `system.cams.cam0/1/2` mit JSON mit Breite, Höhe und fps.\nGeändert: Adapterkonfiguration für das Abfrageintervall und die dreifachen Triggerschwellen werden nun über jsonConfig (Dropdowns und Nummernfelder) voll angesteuert.\nEntfernt: Experimentelles Licht/Power Alias Mapping aus interner Logik (keine Benutzersichtbarkeit wurde freigegeben).",
        "ru": "Изменение: реструктурированная системная информация в выделенные каналы «system.hardware», «system.software» и «system.cams».\nДобавлено: Новые состояния информации о программном обеспечении («desktopVersion», «boardVersion», «платформа», «os») и состояния информации о аппаратном обеспечении («kernelArch», «cpuModel», «hostname»).\nДобавлено: В конфигурации камеры указано \"system.cams.cam0/1/2\", содержащее JSON с шириной, высотой и fps.\nИзмененная конфигурация адаптера для интервала опроса и тройных триггерных порогов теперь полностью приводится в действие через jsonConfig (выпадения и числовые поля).\nУдалено: Экспериментальное отображение света/мощности по внутренней логике (не было выпущено никаких видимых пользователем функций).",
        "pt": "Modificado: Informações do sistema reestruturadas em `system.hardware` dedicado, `system.software' e `system.cams' canais.\nAdicionado: Novos estados de informação de software (`desktopVersion`, `boardVersion`, `platform`, `os`) e estados de informação de hardware (`kernelArch`, `cpuModel`, `hostname`).\nAdicionado: Os estados de configuração da câmera `system.cams.cam0/1/2` contendo JSON com largura, altura e fps.\nModificado: A configuração do adaptador para o intervalo de votação e limiares triplos de gatilho é agora totalmente conduzida através do jsonConfig (dropdowns e campos numéricos).\nRemovido: Mapeamento de alias de luz/potência experimental da lógica interna (nenhum recurso visível pelo usuário foi lançado).",
        "nl": "Veranderd: Gestructureerde systeeminformatie in dedicated .\nToegevoegd: Nieuwe software info states (.\nToegevoegd: Camera-configuratie staat voor \"system.cams.cam0/1/2.\nGewijzigd: Adapterconfiguratie voor polling interval en triple trigger drempels is nu volledig gedreven via jsonConfig (dropdowns en nummervelden).\nVerwijderd: Experimenteel licht/kracht alias mapping van interne logica (er werd geen gebruikerszichtbare functie vrijgegeven).",
        "fr": "Changed: Restructuration des informations système en canaux dédiés `system.hardware`, `system.software` et `system.cams`.\nAjouté : Nouveaux états d'information logicielle (`desktopVersion`, `boardVersion`, `platform`, `os`) et états d'information matérielle (`kernelArch`, `cpuModel`, `hostname`).\nAjouté: La configuration de la caméra indique `system.cams.cam0/1/2` contenant JSON avec largeur, hauteur et fps.\nChanged: La configuration de l'adaptateur pour l'intervalle de vote et les seuils de triple déclenchement est maintenant entièrement pilotée via jsonConfig (champs déroulants et nombres).\nSupprimé: Carte expérimentale alias lumière/puissance à partir de la logique interne (aucune fonctionnalité visible par l'utilisateur n'a été publiée).",
        "it": "Modificato: informazioni di sistema ristrutturate nei canali `system.hardware` dedicati, `system.software` e `system.cams`.\nAggiunto: Nuovo software info stati (`desktopVersion`, `boardVersion`, `platform`, `os`) e dati hardware stati (`kernelArch`, `cpuModel`, `hostname`).\nAggiunto: Configurazione della fotocamera stati `system.cams.cams.cam0/1/2` contenente JSON con larghezza, altezza e fps.\nModificato: la configurazione dell'adattatore per l'intervallo di polling e le soglie di trigger triple è ora completamente guidata tramite jsonConfig (dropdown e campi numerici).\nRimuoveto: Sperimentale mappatura alias della luce dalla logica interna (non è stata rilasciata alcuna funzione visibile dall'utente).",
        "es": "Cambio: información reestructurada del sistema en canales dedicados `system.hardware`, `system.software` y `system.cams`.\nAñadido: New software info states (`desktopVersion`, `boardVersion`, `platform`, `os`) and hardware info states (`kernelArch`, `cpuModel`, `hostname`).\nAñadido: configuración de la cámara estados `system.cams.cam0/1/2` que contienen JSON con ancho, altura y fps.\nCambio: la configuración del adaptador para intervalos de votación y los umbrales de triple disparador ahora se conduzcan completamente a través de jsonConfig (dropdowns y campos de números).\nEliminado: Experimental light/power alias mapping from internal logic (no user-visible feature was released).",
        "pl": "Zmienione: Przekształcone informacje systemowe na dedykowane kanały \"system.hardware\", \"system.software\" i \"system.cams\".\nDodano: nowe stany informatyczne oprogramowania ('desktopVersion', 'boardVersion', 'platform', 'os') oraz stany informacyjne sprzętu ('kernelArch', 'cpuModel', 'hostname').\nDodano: Konfiguracja kamery stanowi system.cams.cam0 / 1 / 2 'zawierający JSON o szerokości, wysokości i fps.\nZmieniona: Konfiguracja adaptera dla interwałów wyborczych i potrójnych progów wyzwalających jest teraz w pełni napędzana przez jsonConfig (zrzuty i pola liczbowe).\nUsunięty: Experimental light / power alias mapowanie z wewnętrznej logiki (nie została wydana żadna widoczna funkcja użytkownika).",
        "uk": "Змінено: Реструктуризація інформації про систему у виділених `system.hardware`, `system.software` та `system.cams`.\nДодано: Нові інформаційні стани програмного забезпечення (`desktopVersion`, `boardVersion`, `platform`, `os`) та апаратні засоби (`kernelArch`, `cpuModel`, `hostname`).\nДодано: Налаштування камери стани `system.cams.cam0/1/2`, що містять JSON з шириною, висотою і fps.\nЗмінено: Налаштування адаптера для інтервалу опитування та потрійних порогів тригера тепер повністю керована за допомогою jsonConfig (розгортання та кількість полів).\nВидалено: Експериментальні джерела світла/power alias з внутрішньої логіки (без функції користувача).",
        "zh-cn": "更改:将系统信息结构改为专用的`系统.硬件'、`系统.软件'和`系统.摄像头'频道.\n添加:新的软件信息状态(`台式计算机Version'、`boardVersion'、`平台'、`os')和硬件信息状态(`内核Arch'、`cpuModel'、`hostname').\n添加:相机配置为`system.cams.cam0/1/2',内含JSON,宽度,高度和fps.\n更改:用于投票间隔和三重触发阈值的适配器配置现在通过jsonConfig(滴落和数字字段)完全驱动.\n删除:实验光/功率别名从内部逻辑映射(没有发布用户可见特性)."
      },
      "0.3.3": {
        "en": "Changed: Configuration fields interval and triggerReset now use seconds instead of milliseconds in the admin UI.",
        "de": "Geändert: Konfiguration Felder Intervall und TriggerReset verwenden jetzt Sekunden statt Millisekunden im Admin UI.",
        "ru": "Изменение: интервалы полей конфигурации и триггер сброс теперь используют секунды вместо миллисекунд в пользовательском интерфейсе администратора.",
        "pt": "Modificado: Intervalo de campos de configuração e gatilhoReset agora use segundos em vez de milissegundos na interface de administração.",
        "nl": "Gewijzigd: Configuratievelden interval en triggerReset gebruikt nu seconden in plaats van milliseconden in de admin UI.",
        "fr": "Changed: Champs de configuration intervalle et triggerReset maintenant utiliser secondes au lieu de millisecondes dans l'interface utilisateur admin.",
        "it": "Modificato: intervallo di campi di configurazione e triggerReset ora utilizzare secondi invece di millisecondi nell'interfaccia utente di amministrazione.",
        "es": "Cambio: intervalo de campos de configuración y gatilloReset ahora use segundos en lugar de milisegundos en la interfaz de administración.",
        "pl": "Zmieniony: Przedział pól konfiguracyjnych i tryggerReset używają teraz sekund zamiast milisekund w interfejsu administratora.",
        "uk": "Змінено: інтервал конфігураційних полів і тригерЗмінити зараз за допомогою секунд замість мілісекундів в адмін UI.",
        "zh-cn": "已更改: 配置字段间隔和触发 Reset 现在在管理员UI中使用秒而不是毫秒 ."
      },
      "0.3.2": {
        "en": "**ENHANCED**: Fixed all TypeScript type errors by adding proper type definitions for config properties\n**ENHANCED**: Refactored HTTP request handling - created reusable httpHelper module to eliminate code duplication\n**ENHANCED**: Converted HTTP callback-based requests to async/await pattern for better error handling\n**ENHANCED**: Improved connection state logging - now logs when connection is restored after being offline\n**ENHANCED**: Standardized async/await usage across all state change handlers for consistency\n**FIXED**: Removed unused error variable in fetchVersion method\n**FIXED**: Added proper error type checking in fetchConfig to prevent runtime errors\n**TESTING**: Added comprehensive unit tests for httpHelper module covering success, timeout, and error scenarios",
        "de": "**ENHANCED**: Alle TypeScript-Typfehler behoben, indem richtige Typendefinitionen für config-Eigenschaften hinzugefügt wurden\n**ENHANCED**: Refactored HTTP Request Handling - erstelltes wiederverwendbares httpHelper Modul zur Beseitigung der Codevervielfachung\n**ENHANCED**: Konvertierte HTTP-Requests auf async/await-Muster für eine bessere Fehlerbehandlung\n**ENHANCED**: Verbesserte Verbindungszustandsprotokollierung - protokolliert nun, wenn die Verbindung nach Offline wiederhergestellt wird\n**ENHANCED**: Standardisierte async/await Nutzung über alle State Change-Handler für Konsistenz\n**FIXED**: Ungenutzte Fehlervariable in fetchVersion Methode entfernt\n**FIXED**: Es wurde eine ordnungsgemäße Fehlersuche im fetchConfig hinzugefügt, um Laufzeitfehler zu verhindern\n**TESTING**: Ergänzende Unit-Tests für das httpHelper-Modul für Erfolgs-, Timeout- und Fehlerszenarien",
        "ru": "** УСТАНОВЛЕНО**: исправлены все ошибки типа TypeScript путем добавления правильных определений типа для свойств конфигурации\n**УДАЛЕН**: Рефакторированная обработка HTTP-запросов - создан многоразовый модуль httpHelper для устранения дублирования кода\n** УВЕДОМЛЕН**: преобразованные HTTP-запросы на основе обратного вызова для улучшения обработки ошибок\n** ВОССТАНОВЛЕНИЕ**: Улучшенная регистрация состояния соединения - теперь журналы, когда соединение восстанавливается после автономного подключения\n** УСТАНОВЛЕНО**: Стандартизированное использование асинхронизации/ожиданий для всех обработчиков изменений состояния\n**FIXED**: Удаление неиспользуемой переменной ошибки в методе fetchVersion\n**FIXED**: добавлена правильная проверка типа ошибки в fetchConfig для предотвращения ошибок во время выполнения\n** Тестирование**: добавлены комплексные единичные тесты для модуля httpHelper, охватывающие сценарии успеха, тайм-аута и ошибок",
        "pt": "**Enhanced**: Corrigido todos os erros de tipo TypeScript adicionando definições de tipo adequadas para as propriedades de configuração\n**ENHANCED**: Refactored HTTP request handling - created reutilizable httpHelper module to elimine code duplication\n**ENHANCED**: Requisições baseadas em callback HTTP convertidas para o padrão assync/await para melhor manipulação de erros\n**Enhanced**: Registro melhorado do estado da conexão - agora registra quando a conexão é restaurada após estar offline\n**ENHANCED**: Uso padrão de assync/await em todos os manipuladores de mudança de estado para consistência\n**FIXED**: Variável de erro não utilizada removida no método fetchVersion\n**FIXED**: Adicionado o tipo de erro correto verificando no fetchConfig para evitar erros de execução\n**TESTING**: Adicionados testes unitários abrangentes para o módulo httpHelper cobrindo cenários de sucesso, tempo e erro",
        "nl": "**ENHANCED**: Fixed all TypeScript type fouten door het toevoegen van juiste type definities voor config eigenschappen\n**ENHANKELIJK**: Refactored HTTP request handling - herbruikbare httpHelper module gemaakt om code duplicatie te elimineren\n**ENHANCED**: Converted HTTP callback-gebaseerde verzoeken om async/wacht patroon voor betere foutafhandeling\n**ENHANCED**: Verbeterde verbindingstoestand logging - nu logt wanneer de verbinding wordt hersteld na offline zijn\n** ANTWOORD**: Gestandaardiseerd async/wacht gebruik in alle state change handlers voor consistentie\n** VAST**: Verwijderde ongebruikte fout variabele in fetchVersie methode\n** VAST**: Toegevoegd juiste fout type controleren in fetchConfig om runtime fouten te voorkomen\n**TESTING**: Toegevoegd uitgebreide unit testen voor httpHelper module over succes, timeout, en fout scenario's",
        "fr": "**ENHANCED**: Correction de toutes les erreurs de type TypeScript en ajoutant des définitions de type appropriées pour les propriétés de configuration\n**ENHANDED**: Refactored HTTP request handling - créé module httpHelper réutilisable pour éliminer la duplication de code\n**ENHANCED**: Converti les requêtes basées sur le callback HTTP en modèle async/attendit pour une meilleure gestion des erreurs\n**ENHANCED**: Amélioration de l'enregistrement d'état de connexion - logs maintenant lorsque la connexion est restaurée après être hors ligne\n**CHANGE**: utilisation normalisée async/attendue dans tous les gestionnaires de changement d'état pour une cohérence\n**FIXED**: Supprimé la variable d'erreur inutilisée dans la méthode fetchVersion\n**FIXED**: Ajout d'une vérification de type d'erreur dans fetchConfig pour prévenir les erreurs d'exécution\n**TESTING**: Ajout de tests unitaires complets pour le module httpHelper couvrant les scénarios de succès, de délai et d'erreur",
        "it": "**ENHANCED**: Risolto tutti gli errori di tipo TypeScript aggiungendo definizioni di tipo corrette per proprietà di configurazione\n**ENHANCED**: Refactored HTTP request handling - creato modulo httpHelper riutilizzabile per eliminare la duplicazione di codice\n**ENHANCED**: Le richieste basate su callback HTTP convertite in un modello asinc/aspettato per una migliore gestione degli errori\n**ENHANCED**: Registrazione dello stato di connessione migliorata - ora i log quando la connessione viene ripristinata dopo essere offline\n**ENHANCED**: Uso standardizzato asinc/aspettato in tutti i maneggiatori di cambio di stato per consistenza\n**FIXED**: Rimossa variabile di errore non utilizzata nel metodo fetchVersion\n**FIXED**: Aggiunta il corretto tipo di errore di controllo in fetchConfig per evitare errori runtime\n**TESTING**: Aggiunti test unitari completi per il modulo httpHelper che copre il successo, il timeout e gli scenari di errore",
        "es": "**ENHANCED**: Arregla todos los errores tipo TipoScript añadiendo definiciones adecuadas para propiedades de configuración\n**ENHANCED**: Refactored HTTP request handling - creó el módulo httpHelper reutilizable para eliminar la duplicación de códigos\n**ENHANCED**: Solicitudes convertidas basadas en llamadas HTTP a async/await patrón para un mejor manejo de errores\n**ENHANCED**: Mejora de la conexión de registro de estado - ahora registros cuando la conexión se restaura después de estar fuera de línea\n**ENHANCED**: El uso estandarizado async/await en todos los manejadores del cambio estatal para la consistencia\n**FIXED**: Retire la variable de error no utilizado en el método fetchVersion\n**FIXED**: Añadido el tipo de error correcto en fetchConfig para evitar errores de tiempo de ejecución\n** Notas**: Se agregaron pruebas de unidad completas para el módulo httpHelper que abarcan el éxito, el tiempo y los escenarios de error",
        "pl": "* *ENHANCED* *: Naprawiono wszystkie błędy typu TypeScript poprzez dodanie właściwych definicji typów dla właściwości konfiguracyjnych \n* *ENHANCED* *: Refactored HTTP request handling - created realisable httpHelper module to elimination code duplication \n* *ENHANCED* *: Konwertowany HTTP połączeń backback prośby async / czekać wzór dla lepszej obsługi błędów \n* *ENHANCED* *: Ulepszone logowanie stanu połączenia - teraz loguje się, gdy połączenie jest przywrócone po offline \n* *ENHANCED* *: Standaryzowane async / czekać na wykorzystanie we wszystkich stanowych opiekunów zmian dla spójności \n* *FIXED* *: Usunięto nieużywaną zmienną błędu w metodzie fetchVersion \n* *FIXED* *: Dodano poprawny typ błędu sprawdzający w fetchConfig, aby zapobiec błędom w runtime \n* *TESTING* *: Dodano kompleksowe testy jednostkowe dla modułu httpHelper obejmujące sukcesy, timeout i scenariusze błędów ",
        "uk": "**ENHANCED**: Виправлено всі помилки типу TypeScript, додаючи правильні визначення типу для властивостей конфігурації\n**ENHANCED**: Перефакторований HTTP-запитування - створений багаторазовий модуль HTTPHelper для усунення дублікатів коду\n**ENHANCED**: Конвертовані запити на основі HTTP-повідомлень на основі async/await для кращої обробки помилок\n**ENHANCED***: Покращується з'єднання держреєстрації - тепер журнали, коли з'єднання відновлюється після офлайн\n**ENHANCED***: стандартизоване використання async/await у всіх ручках зі змінами стану для консистенції\n**FIXED**: Видалено невикористану змінну помилку в методі fetchVersion\n**FIXED***: Додано належну перевірку типу помилки в fetchConfig, щоб запобігти помилки часу\n**TESTING***: Додано комплексні тести для модуля httpHelper, що охоплює успіхи, часовий час та сценарії помилок",
        "zh-cn": "** ENHANCED**:通过添加适当的配置属性类型定义来固定所有类型脚本类型错误\n** ENHANCED **: 重置了 HTTP 请求处理 - 创建了可重复使用的 httpHelper 模块,以消除代码重复\n** ENHANCED**: 将基于 HTTP 回调请求转换为同步/等待模式,以更好地处理错误\n** ENHANCED **: 连接状态记录的改进 -- -- 下线后恢复连接时的日志\n** ENHANCED**:所有州变化处理器的标准化合成/等待使用,以保持一致\n** FIXED**:删除了拾取Version 方法中的未使用错误变量\n** FIXED**:在获取中添加适当的错误类型检查Config以防止运行时间错误\n** TESTING**:为httpHelper模块添加了涵盖成功、超时和错误情景的综合单元测试"
      },
      "0.3.1": {
        "en": "Changed: Object creation now uses extendObjectAsync with proper roles and types instead of setObjectNotExistsAsync.",
        "de": "Geändert: Objekt-Erstellung verwendet jetzt ExtendedObjectAsync mit richtigen Rollen und Typen anstelle von Set ObjectNotExistsAsync.",
        "ru": "Изменилось: Создание объектов теперь использует extendObjectAsync с правильными ролями и типами вместо набора ObjectNotExistsAsync.",
        "pt": "Alterado: Criação de objetos agora usa extendObjectAsync com papéis e tipos apropriados em vez de set ObjectNotExistsAsync.",
        "nl": "Gewijzigd: Objectcreatie maakt nu gebruik van extendObjectAsync met juiste rollen en typen in plaats van set ObjectNietBestaatAsync.",
        "fr": "Changement : La création d'objet utilise désormais extensionObjectAsync avec des rôles et types appropriés au lieu de set ObjetNotExistsAsync.",
        "it": "Cambiato: Creazione oggetti ora utilizza extendObjectAsync con ruoli e tipi appropriati invece di set ObjectNotExistsAsync.",
        "es": "Cambio: La creación de objetos ahora utiliza ExtendObjectAsync con roles y tipos adecuados en lugar de conjunto ObjectNoExistsAsync.",
        "pl": "Zmieniono: Tworzenie obiektu wykorzystuje teraz extendObjectAsync z odpowiednimi rolami i typami zamiast zestawu ObjectNotExistsAsync.",
        "uk": "Змінено: Створення об'єктів тепер використовує розширенняObjectAsync з відповідними ролями та типами замість набору Об'єктNotExistsAsync.",
        "zh-cn": "已更改 : 对象创建现在使用扩展对象Async , 并配有合适的角色和类型而不是设定 Object NotExists Async. (原始内容存档于2018-09-31)."
      }
    },
    "titleLang": {
      "en": "Autodarts Integration",
      "de": "Autodarts-Integration",
      "ru": "Интеграция Autodarts",
      "pt": "Integração com Autodarts",
      "nl": "AutoDART-integratie",
      "fr": "Intégration d'Autodarts",
      "it": "Integrazione Autodarts",
      "es": "Integración de Autodarts",
      "pl": "Integracja Autodarts",
      "uk": "Інтеграція з AutoDarts",
      "zh-cn": "Autodarts 集成"
    },
    "desc": {
      "en": "Connects the ioBroker to the local Autodarts Board Manager.\n\nProvides states and events for the current game, allowing to trigger lights, sounds, text-to-speech, or other automations.",
      "de": "Verbindet den ioBroker mit dem lokalen Autodarts Board Manager.\n\nBietet Zustände und Ereignisse für das aktuelle Spiel, wodurch Lichter, Töne, Text-zu-Sprache oder andere Automatisierungen ausgelöst werden können.",
      "ru": "Обеспечивает связь ioBroker с локальным менеджером досок Autodarts.\n\nПредоставляет состояния и события для текущей игры, позволяя запускать световые эффекты, звуки, преобразование текста в речь или другие автоматизированные действия.",
      "pt": "Conecta o ioBroker ao Gerenciador de Tabuleiro Autodarts local.\n\nFornece estados e eventos para o jogo atual, permitindo acionar luzes, sons, conversão de texto em fala ou outras automações.",
      "nl": "Verbindt de ioBroker met de lokale Autodarts Board Manager.\n\nBiedt statussen en gebeurtenissen voor het huidige spel, waardoor het mogelijk is om lichten, geluiden, tekst-naar-spraak of andere automatiseringen te activeren.",
      "fr": "Connecte l'ioBroker au gestionnaire de plateau Autodarts local.\n\nFournit les états et les événements du jeu en cours, permettant de déclencher des lumières, des sons, la synthèse vocale ou d'autres automatisations.",
      "it": "Collega ioBroker al gestore locale del tabellone Autodarts.\n\nFornisce stati ed eventi per il gioco in corso, consentendo di attivare luci, suoni, sintesi vocale o altre automazioni.",
      "es": "Conecta el ioBroker al administrador de tablero Autodarts local.\n\nProporciona estados y eventos para el juego actual, lo que permite activar luces, sonidos, texto a voz u otras automatizaciones.",
      "pl": "Łączy ioBroker z lokalnym menadżerem płyt Autodarts.\n\nZawiera stany i zdarzenia dla bieżącej gry, umożliwiając aktywację świateł, dźwięków, zamiany tekstu na mowę lub innych automatyzacji.",
      "uk": "Підключає ioBroker до локального менеджера дошки Autodarts.\n\nНадає стани та події для поточної гри, дозволяючи запускати світло, звуки, перетворення тексту в мовлення або інші автоматизації.",
      "zh-cn": "将 ioBroker 连接到本地 Autodarts 棋盘管理器。\n\n为当前游戏提供状态和事件，允许触发灯光、声音、文本转语音或其他自动化功能。"
    },
    "authors": [
      "skvarel <skvarel@inventwo.com>"
    ],
    "keywords": [
      "dart",
      "scoring",
      "game",
      "automations",
      "autodarts"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "autodarts.svg",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.autodarts/main/admin/autodarts.svg",
    "enabled": true,
    "loglevel": "info",
    "mode": "daemon",
    "tier": 3,
    "type": "protocols",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "host": "127.0.0.1",
    "port": 3180,
    "intervalSec": 1,
    "triggerResetSec": 0,
    "tripleMinScore": 1,
    "tripleMaxScore": 20,
    "lightTargetId": "",
    "powerTargetId": ""
  },
  "objects": [],
  "instanceObjects": []
}
