{
  "common": {
    "name": "autodarts",
    "version": "1.0.7",
    "news": {
      "1.0.7": {
        "en": "CI/CD: Updated GitHub Copilot instructions template to version 0.5.7 with latest ioBroker best practices (fixes #21, #25)",
        "de": "CI/CD: Updated GitHub Copilot Anleitungsvorlage auf Version 0.5.7 mit neuesten ioBroker Best Practices (fixes #21, #25)",
        "ru": "CI/CD: обновленный шаблон инструкций GitHub Copilot до версии 0.5.7 с последними лучшими практиками ioBroker (исправления #21, #25)",
        "pt": "CI/CD: Modelo de instruções do GitHub Copilot atualizado para a versão 0.5.7 com as melhores práticas do ioBroker mais recentes (fixes #21, #25)",
        "nl": "CI/CD: Bijgewerkt GitHub Copilot instructies template naar versie 0.5.7 met de nieuwste ioBroker best practices (fixes #21, #25)",
        "fr": "CI/CD: Mise à jour du modèle d'instructions du copilote GitHub à la version 0.5.7 avec les dernières pratiques exemplaires ioBroker (fixes #21, #25)",
        "it": "CI/CD: Aggiornato modello di istruzioni GitHub Copilot alla versione 0.5.7 con le migliori pratiche ioBroker (fissi #21, #25)",
        "es": "CI/CD: Actualizada plantilla de instrucciones GitHub Copilot a la versión 0.5.7 con las mejores prácticas de yoBroker (fijos #21, #25)",
        "pl": "CI / CD: Aktualizacja szablonu instrukcji GitHub Copilot do wersji 0.5.7 z najnowszymi najlepszymi praktykami ioBroker (poprawki # 21, # 25)",
        "uk": "CI/CD: Оновлений шаблон інструкцій GitHub Copilot до версії 0.5.7 з новітніми ioBroker кращих практик (фікси #21, #25)",
        "zh-cn": "CI/CD: 更新了 GitHub 副驾驶指令模板至 0.5.7 版本,并附有最新的 ioBroker 最佳做法 (fixes #21, #25)"
      },
      "1.0.6": {
        "en": "TESTING: Fixed test cleanup issues - added settled flag to httpHelper for proper Promise handling and --exit flag to test script to prevent hanging tests",
        "de": "TESTING: Fixed Test Cleanup-Probleme - fügte dem httpHelper eine abgegrenzte Flagge für die ordnungsgemäße Promise-Handling und --exit-Flag zum Testskript hinzu, um hängende Tests zu verhindern",
        "ru": "Тестирование: исправленные проблемы с очисткой тестов - добавлен урегулированный флаг для httpHelper для правильной обработки обещаний и флаг выхода для тестирования сценария для предотвращения испытаний на подвеску",
        "pt": "TESTAMENTO: Problemas de limpeza de teste fixos - bandeira fixa adicionada ao httpHelper para o manuseio adequado do Promise e --exit flag para testar o script para evitar testes suspensos",
        "nl": "TESTEN: Vaste test opschoning problemen - toegevoegd vaste vlag aan httpHelper voor de juiste belofte handling en --exit vlag om te testen script om opknoping testen te voorkomen",
        "fr": "ESSAI: Correction des problèmes de nettoyage des tests - ajout d'un drapeau réglé à httpHelper pour une bonne manipulation de la promesse et --exit drapeau pour tester le script pour empêcher les tests suspendus",
        "it": "TESTING: Problemi di pulizia del test fissi - ha aggiunto la bandiera fissa a httpHelper per una corretta gestione Promise e --exit bandiera per testare lo script per prevenire i test appesi",
        "es": "TESTING: Problemas de limpieza de pruebas fijos - añadido bandera asentada a httpHelper para el manejo apropiado de la promesa y --exit flag para probar script para evitar pruebas de colgar",
        "pl": "TESTING: Stałe problemy z czyszczeniem testów - dodano flagę rozliczoną do httpHelper dla prawidłowego obsługi obietnic i --exit flag do testowania skryptu, aby zapobiec powieszeniu testów",
        "uk": "TESTING: Виправлені проблеми очищення тесту - додано валідований прапор до httpHelper для належного використання Promise і --exit прапор, щоб перевірити скрипт, щоб запобігти висихання тестів",
        "zh-cn": "TESTING: 固定测试清理问题 - 在 httpHelper 中添加已结算的旗帜, 用于适当的承诺处理和 -- 退出旗帜, 用于测试脚本以防止悬挂测试"
      },
      "1.0.5": {
        "en": "FIXED: Updated outdated dependencies - release-script packages to v5.1.x and admin globalDependency to v7.6.20 (fixes #23)",
        "de": "FIXED: Aktualisierte veraltete Abhängigkeiten - Release-script-Pakete zu v5.1.x und admin globalDependency to v7.6.20 (fixes #23)",
        "ru": "FIXED: Обновленные устаревшие зависимости - пакеты релиз-скрипта для v5.1.x и админ GlobalDependency для v7.6.20 (фиксы #23)",
        "pt": "FIXED: Dependências desatualizadas atualizadas - pacotes release-script para v5.1.x e administrador globalDependência para v7.6.20 (fixes #23)",
        "nl": "VASTE: Bijgewerkt verouderde afhankelijkheden - release-script pakketten naar v5.1.x en admin globalDependency naar v7.6.20 (fixes #23)",
        "fr": "FIXÉ: Mise à jour des dépendances obsolètes - paquets release-script vers v5.1.x et admin globalDependency vers v7.6.20 (fixes #23)",
        "it": "FISSO: Aggiornato dipendenze obsolete - release-script package a v5.1.x e admin globalDependency a v7.6.20 (fissi n.23)",
        "es": "FIXED: Actualización de dependencias obsoletas - paquetes de código de liberación a v5.1.x y administración globalDependencia a v7.6.20 (fijos #23)",
        "pl": "FIXED: Aktualizacja przestarzałych zależności - pakiety release- script do v5.1.x i admin globalDependency do v7.6.20 (poprawki # 23)",
        "uk": "FIXED: Оновлено застарілі залежності - випускні пакети до v5.1.x і admin GlobalDependency to v7.6.20 (фікси #23)",
        "zh-cn": "FIXED: 更新过时的依赖性 - 发布标记包到 v5. 1. x 和 管理全局依赖性到 v7. 6. 20 (fixes #23)"
      },
      "1.0.4": {
        "en": "FIXED: Reverted to setState() from deprecated setStateAsync()",
        "de": "FIXED: Revertiert auf setState() von deprecated setStateAsync()",
        "ru": "FIXED: Reverted to setState() from deprecated setStateAsync()",
        "pt": "FIXED: Revertido para setState() do setStateAsync() desactualizado",
        "nl": "VASTE: Teruggekeerd naar setState() van verouderde setStateAsync()",
        "fr": "FIXÉ: Réverti à setState() de setStateAsync()",
        "it": "FISSO: Revertito per impostareState() da set deprecatoStateAsync()",
        "es": "FIXED: Revertido a establecer el Estado() de un estado precatadoAsync()",
        "pl": "FIXED: Odwrócony do setState () z deprecated setStateAsync ()",
        "uk": "FIXED: Перевернуто до setState() від deprecated setStateAsync()",
        "zh-cn": "FIXED: 从已贬值的设置中恢复为设置状态( ) State Async ()"
      },
      "1.0.3": {
        "en": "FIXED: Reverted to setState() from deprecated setStateAsync() - setState returns a Promise when used without callback (ioBroker best practice)\nENHANCED: Corrected API endpoints in copilot-instructions.md - now documents /api/state, /api/config, /api/host, /api/version correctly\nTESTING: Added comprehensive unit tests for core modules (throw, visit, config, trafficLight, httpHelper)",
        "de": "KORREKTUR: Zurück zu setState() von veraltetem setStateAsync() - setState gibt Promise zurück, wenn ohne Callback verwendet (ioBroker Best Practice)\nVERBESSERUNG: Berichtigte API-Endpunkte in copilot-instructions.md - dokumentiert nun korrekt /api/state, /api/config, /api/host, /api/version\nTESTING: Ergänzende Unit-Tests für Kernmodule (throw, visit, config, trafficLight, httpHelper)",
        "ru": "FIXED: Используйте setStateAsync() вместо setState() для сброса триггера в броске. js для обеспечения надежности базы данных\nИсправленные конечные точки API в инструкциях копилота. md - теперь документы /api/state, /api/config, /api/host, /api/version правильно\nТестирование: Добавлены комплексные единичные тесты для основных модулей (брос, посещение, конфигурация, TrafficLight, httpHelper)",
        "pt": "FIXED: Use setStateAsync() em vez de setState() para resets de gatilho. js para garantir a confiabilidade do banco de dados\nEnhanced: Endpoints de API corrigidos em instruções de copiloto. md - agora documentos /api/state, /api/config, /api/host, /api/version corretamente\nTESTAMENTO: Adicionados testes unitários abrangentes para módulos centrais (jogar, visitar, configurar, trafficLight, httpHelper)",
        "nl": "VAST: Gebruik setStateAsync() in plaats van setState() voor trigger resets in de worp. js om de betrouwbaarheid van de database te garanderen\nVERHAALD: gecorrigeerde API-eindpunten in instructies voor de copiloot. md - nu documenten /api/state, /api/config, /api/host, /api/version correct\nTESTEN: Toegevoegd uitgebreide unit testen voor kernmodules (gooien, bezoeken, config, verkeerLight, httpHelper)",
        "fr": "FIXÉ: Utilisez setStateAsync() au lieu de setState() pour réinitialiser le déclencheur en lancer. js pour assurer la fiabilité de la base de données\nRENFORCEMENT: Correction des paramètres de l'API dans les instructions de copilote. md - maintenant documents /api/state, /api/config, /api/host, /api/version correctement\nESSAI: Ajout de tests unitaires complets pour les modules de base (jetez, visitez, config, trafficLight, httpHelper)",
        "it": "FISSO: Utilizzare setStateAsync() invece di setState() per reset di trigger in lancio. js per garantire l'affidabilità del database\nENHANCED: endpoint API corretti in istruzioni copilota. md - ora documenti /api/state, /api/config, /api/host, /api/version correttamente\nTESTING: Aggiunti test unitari completi per moduli core (freccia, visita, configurazione, trafficoLuce, httpHelper)",
        "es": "FIXED: Use setStateAsync() en lugar de setState() para activar resetes en tiro. js para garantizar la fiabilidad de la base de datos\nENHANCED: Puntos finales de API corregidos en instrucciones de copiloto. md - ahora documentos /api/state, /api/config, /api/host, /api/version correctamente\nTESTING: Se han añadido pruebas de unidad integrales para módulos básicos (hacia, visita, config, trafficLight, httpHelper)",
        "pl": "FIXED: Użyj setStateAsync () zamiast setState () dla resetów w rzucie. js w celu zapewnienia niezawodności bazy danych\nPOPRAWKA: Skorygowane punkty końcowe API w instrukcjach copilot-. md - teraz dokumenty / api / state, / api / config, / api / host, / api / version poprawnie\nTESTING: Dodano kompleksowe testy jednostkowe dla modułów podstawowych (rzut, wizyta, config, traffic Light, httpHelper)",
        "uk": "FIXED: Використовуйте setStateAsync() замість setState() для запуску скидання в кисті. js для забезпечення надійності бази даних\nENHANCED: Виправлені кінцеві точки API в копілот-інструкції. md - тепер документи /api/state, /api/config, /api/host, /api/version правильно\nTESTING: Додано комплексні тести для базових модулів (рядок, візит, налаштування, трафікLight, httpHelper)",
        "zh-cn": "FIXED: 使用setStateAsync () 而不是setState () 来重击触发器 。 js,以确保数据库的可靠性\n增强:在副驾驶指令中纠正API端点. md - 现在文档 /api/ state,/api/config,/api/host,/api/版本正确\nTESTING:核心模块(推、访问、配置、交通灯、httphelper)的新增综合单元测试"
      },
      "1.0.2": {
        "en": "ENHANCED: Refactored adapter code into modular architecture for improved maintainability and code quality – no functional changes for end users",
        "de": "ENHANCED: Refactored adapter code in modulare Architektur für verbesserte Aufrechterhaltungs- und Codequalität – keine funktionalen Änderungen für Endanwender",
        "ru": "Рефакторированный код адаптера в модульную архитектуру для улучшения ремонтопригодности и качества кода - никаких функциональных изменений для конечных пользователей",
        "pt": "REHANCED: Código adaptador refatorizado em arquitetura modular para melhor manutenção e qualidade de código – sem alterações funcionais para usuários finais",
        "nl": "VERHAALD: Gerefactoreerde adaptercode in modulaire architectuur voor verbeterde onderhoudbaarheid en codekwaliteit",
        "fr": "RENFORCEMENT: Refactored adaptateur code en architecture modulaire pour améliorer la maintenance et la qualité du code – aucun changement fonctionnel pour les utilisateurs finaux",
        "it": "ENHANCED: Codice adattatore in architettura modulare per una migliore manutenbilità e qualità del codice – nessun cambiamento funzionale per gli utenti finali",
        "es": "ENHANCED: Código de adaptador refactorizado en arquitectura modular para mejorar la calidad de mantenimiento y código – no hay cambios funcionales para los usuarios finales",
        "pl": "ENHANCED: Przekształcony kod adaptera w architekturę modułową dla poprawy zachowania i jakości kodu - brak zmian funkcjonalnych dla użytkowników końcowych",
        "uk": "ENHANCED: Відновлений код адаптера в модульну архітектуру для підвищення стійкості та якості коду - не функціональні зміни для кінцевих користувачів",
        "zh-cn": "EnhancedD:重构适配器代码为模块架构,以提高可维护性和代码质量 — 对最终用户没有功能变化"
      },
      "1.0.1": {
        "en": "Enhanced: Updated all Node.js built-in module imports to use 'node:' prefix format for better clarity and security\nFixed: Changlog error at readme.md\nImproved: FAQ because of the new structure\nFixed: State roles now comply with ioBroker standards - config states use `level.*` roles, read-only color uses `text` role",
        "de": "Verbessert: Aktualisiert alle Node.js-Einbau-Modulimporte, um 'node:' Präfix-Format für bessere Klarheit und Sicherheit\nBehoben: Changlog-Fehler bei readme. md\nVerbessert: FAQ wegen der neuen Struktur\nBehoben: Die staatlichen Rollen entsprechen jetzt ioBroker Standards - config Staaten verwenden `level.* ` Rollen, Nur lesen Farbe verwendet `text` Rolle",
        "ru": "Улучшено: Обновлен весь импорт встроенных модулей Node.js для использования формата префикса «узел:» для большей ясности и безопасности\nИсправлено: ошибка Changlog в readme. мд\nУлучшенный: FAQ из-за новой структуры\nИсправлено: государственные роли теперь соответствуют стандартам ioBroker - конфигурационные состояния используют роли «уровня»",
        "pt": "Melhorado: Updated all Node.js built-in module importations to use 'node:' prefixo format for better clear and security\nCorrigido: Changlog erro no readme. md\nMelhorado: FAQ por causa da nova estrutura\nFixado: As funções do estado agora cumprem com os padrões do ioBroker - os estados de configuração usam as funções `level.*', a cor somente para leitura usa a função `text'",
        "nl": "Verbeterd: Bijgewerkt alle Node.js ingebouwde module import om 'node:' prefix formaat te gebruiken voor meer duidelijkheid en veiligheid\nFixed: Changlog fout bij readme. md\nVerbeterd: FAQ vanwege de nieuwe structuur\nFixed: State rollen nu voldoen aan joBroker normen - config states maken gebruik van ",
        "fr": "Amélioration : Mise à jour de toutes les importations de modules intégrés Node.js pour utiliser le format préfixe 'node:' pour une meilleure clarté et sécurité\nCorrection : erreur Changlog à la lecture. md\nAmélioration : FAQ en raison de la nouvelle structure\nCorrection : les rôles de l'État sont désormais conformes aux normes ioBroker - les États de configuration utilisent les rôles `level.*`, la couleur en lecture seule utilise le rôle `text`",
        "it": "Migliorato: Aggiornato tutte le importazioni del modulo incorporato Node.js per usare il formato 'nodo:' prefisso per una migliore chiarezza e sicurezza\nRisolto: Errore Changlog a readme. M\nMigliorato: FAQ a causa della nuova struttura\nRisolto: i ruoli di stato sono ora conformi agli standard ioBroker - gli stati di configurazione usano i ruoli `level.*`, il colore di sola lettura utilizza il ruolo `text`",
        "es": "Mejorado: Actualizado todas las importaciones de módulos integrados Node.js para utilizar 'node:' formato prefijo para una mejor claridad y seguridad\nCorregido: Error de Changlog en readme. md\nMejorado: FAQ debido a la nueva estructura\nCorregido: Los papeles del Estado cumplen ahora con las normas de yoBroker - los estados de config utilizan roles de 'nivel.*`, sólo el color de lectura utiliza 'texto' papel",
        "pl": "Wzmocnione: Aktualizacja wszystkich Node.js built- w imporcie modułu do użycia 'node:' format prefix dla większej jasności i bezpieczeństwa\nNaprawiono: błąd Changlog przy readme. md\nUlepszone: FAQ ze względu na nową strukturę\nStała: Role stanu są teraz zgodne ze standardami jOBrokera - stany konfiguracyjne używają 'level. *' roles, kolor tylko read- wykorzystuje 'text' role",
        "uk": "Підвищений: Оновлено всі імпорт модуля Node.js для використання 'node:' prefix формат для кращої чіткості та безпеки\nВиправлено: Похибка Changlog на readme. мд\nПокращується: FAQ через нову структуру\nВиправлено: Державні ролі тепер відповідають нормам ioBroker - конфігураційні стани використовують `level.*`````````````````text```",
        "zh-cn": "增强: 更新所有节点.js内置模块导入以使用“ 节点:” 前缀格式以提高清晰度和安全性\n固定: 朗洛格在readme错误. 微额\n改进:因新结构而提出问题\n固定:国家角色现在符合ioBroker标准 - 配置状态使用“级别”。 角色,只读颜色使用“文本”角色"
      }
    },
    "titleLang": {
      "en": "Autodarts Integration",
      "de": "Autodarts-Integration",
      "ru": "Интеграция Autodarts",
      "pt": "Integração com Autodarts",
      "nl": "AutoDART-integratie",
      "fr": "Intégration d'Autodarts",
      "it": "Integrazione Autodarts",
      "es": "Integración de Autodarts",
      "pl": "Integracja Autodarts",
      "uk": "Інтеграція з AutoDarts",
      "zh-cn": "Autodarts 集成"
    },
    "desc": {
      "en": "Connects the ioBroker to the local Autodarts Board Manager.\n\nProvides states and events for the current game, allowing to trigger lights, sounds, text-to-speech, or other automations.",
      "de": "Verbindet den ioBroker mit dem lokalen Autodarts Board Manager.\n\nBietet Zustände und Ereignisse für das aktuelle Spiel, wodurch Lichter, Töne, Text-zu-Sprache oder andere Automatisierungen ausgelöst werden können.",
      "ru": "Обеспечивает связь ioBroker с локальным менеджером досок Autodarts.\n\nПредоставляет состояния и события для текущей игры, позволяя запускать световые эффекты, звуки, преобразование текста в речь или другие автоматизированные действия.",
      "pt": "Conecta o ioBroker ao Gerenciador de Tabuleiro Autodarts local.\n\nFornece estados e eventos para o jogo atual, permitindo acionar luzes, sons, conversão de texto em fala ou outras automações.",
      "nl": "Verbindt de ioBroker met de lokale Autodarts Board Manager.\n\nBiedt statussen en gebeurtenissen voor het huidige spel, waardoor het mogelijk is om lichten, geluiden, tekst-naar-spraak of andere automatiseringen te activeren.",
      "fr": "Connecte l'ioBroker au gestionnaire de plateau Autodarts local.\n\nFournit les états et les événements du jeu en cours, permettant de déclencher des lumières, des sons, la synthèse vocale ou d'autres automatisations.",
      "it": "Collega ioBroker al gestore locale del tabellone Autodarts.\n\nFornisce stati ed eventi per il gioco in corso, consentendo di attivare luci, suoni, sintesi vocale o altre automazioni.",
      "es": "Conecta el ioBroker al administrador de tablero Autodarts local.\n\nProporciona estados y eventos para el juego actual, lo que permite activar luces, sonidos, texto a voz u otras automatizaciones.",
      "pl": "Łączy ioBroker z lokalnym menadżerem płyt Autodarts.\n\nZawiera stany i zdarzenia dla bieżącej gry, umożliwiając aktywację świateł, dźwięków, zamiany tekstu na mowę lub innych automatyzacji.",
      "uk": "Підключає ioBroker до локального менеджера дошки Autodarts.\n\nНадає стани та події для поточної гри, дозволяючи запускати світло, звуки, перетворення тексту в мовлення або інші автоматизації.",
      "zh-cn": "将 ioBroker 连接到本地 Autodarts 棋盘管理器。\n\n为当前游戏提供状态和事件，允许触发灯光、声音、文本转语音或其他自动化功能。"
    },
    "authors": [
      "skvarel <skvarel@inventwo.com>"
    ],
    "keywords": [
      "dart",
      "scoring",
      "game",
      "automations",
      "autodarts"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "autodarts.svg",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.autodarts/main/admin/autodarts.svg",
    "enabled": true,
    "loglevel": "info",
    "mode": "daemon",
    "tier": 3,
    "type": "protocols",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.20"
      }
    ]
  },
  "native": {
    "host": "127.0.0.1",
    "port": 3180,
    "intervalSec": 1,
    "triggerResetSec": 0,
    "tripleMinScore": 1,
    "tripleMaxScore": 20,
    "lightTargetId": "",
    "powerTargetId": "",
    "toolsIp": "",
    "toolsPort": 8087,
    "toolsInstance": 0,
    "toolsUrlBusted": "",
    "toolsUrlGameon": "",
    "toolsUrlGameshot": ""
  },
  "objects": [],
  "instanceObjects": []
}
