{
  "common": {
    "name": "autodarts",
    "version": "0.3.1",
    "news": {
      "0.3.1": {
        "en": "Changed: Object creation now uses extendObjectAsync with proper roles and types instead of setObjectNotExistsAsync.",
        "de": "Geändert: Objekt-Erstellung verwendet jetzt ExtendedObjectAsync mit richtigen Rollen und Typen anstelle von Set ObjectNotExistsAsync.",
        "ru": "Изменилось: Создание объектов теперь использует extendObjectAsync с правильными ролями и типами вместо набора ObjectNotExistsAsync.",
        "pt": "Alterado: Criação de objetos agora usa extendObjectAsync com papéis e tipos apropriados em vez de set ObjectNotExistsAsync.",
        "nl": "Gewijzigd: Objectcreatie maakt nu gebruik van extendObjectAsync met juiste rollen en typen in plaats van set ObjectNietBestaatAsync.",
        "fr": "Changement : La création d'objet utilise désormais extensionObjectAsync avec des rôles et types appropriés au lieu de set ObjetNotExistsAsync.",
        "it": "Cambiato: Creazione oggetti ora utilizza extendObjectAsync con ruoli e tipi appropriati invece di set ObjectNotExistsAsync.",
        "es": "Cambio: La creación de objetos ahora utiliza ExtendObjectAsync con roles y tipos adecuados en lugar de conjunto ObjectNoExistsAsync.",
        "pl": "Zmieniono: Tworzenie obiektu wykorzystuje teraz extendObjectAsync z odpowiednimi rolami i typami zamiast zestawu ObjectNotExistsAsync.",
        "uk": "Змінено: Створення об'єктів тепер використовує розширенняObjectAsync з відповідними ролями та типами замість набору Об'єктNotExistsAsync.",
        "zh-cn": "已更改 : 对象创建现在使用扩展对象Async , 并配有合适的角色和类型而不是设定 Object NotExists Async. (原始内容存档于2018-09-31)."
      },
      "0.3.0": {
        "en": "Added traffic light datapoints (`status.trafficLightColor`, `status.trafficLightState`) mapped from Board Manager status (`Throw` / `Takeout` / connection errors).\nRefactored code: visit handling, throw handling (triple / bull) and traffic light logic moved to separate modules.",
        "de": "Es wurden Verkehrslichtdatenpunkte (`status.trafficLightColor`, `status.trafficLightState`) aus dem Status Board Manager (`Throw` / `Takeout` / Verbindungsfehler) abgebildet.\nRefactored Code: Besuchen Sie Handling, Wurf Handling (Triple / Bull) und Ampellogik in separate Module bewegt.",
        "ru": "Добавлены точки данных светофора («status.trafficLightColor», «status.trafficLightState»), отображаемые из статуса менеджера совета директоров («Бросить» / «Выбрать» / ошибки подключения).\nРефакторированный код: обработка посещений, обработка бросков (тройной / бычий) и логика светофора перемещаются в отдельные модули.",
        "pt": "Pontos de dados de semáforo adicionados (`status.trafficLightColor`, `status.trafficLightState`) mapeados a partir do status do Board Manager (`Throw` / `Takeout` / erros de conexão).\nCódigo refatorizado: manipulação de visita, manuseio de arremesso (triplo / touro) e lógica de semáforo movido para módulos separados.",
        "nl": "Toegevoegd verkeerslicht datapoints (.\nRefactored code: bezoeken handling, gooien handling (triple / stier) en verkeerslicht logica verplaatst naar aparte modules.",
        "fr": "Ajout de points de données de feux de circulation (`status.trafficLightColor`, `status.trafficLightState`) cartographié à partir de l'état du gestionnaire du conseil d'administration (`Throw` / `Takeout` / erreurs de connexion).\nCode refactoré: visite de la manipulation, la manipulation de lancer (triple / taureau) et la logique du feu de circulation déplacé vers des modules séparés.",
        "it": "Aggiunti i datapoint del semaforo (`status.trafficLightColor`, `status.trafficLightState`) mappati dallo stato del Board Manager (`Throw` / `Takeout` / errori di connessione).\nCodice Refactored: visit handling, pitch handling (triple / bull) e logica del semaforo spostato a moduli separati.",
        "es": "Los puntos de datos de la luz de tráfico ( \"status.trafficLightColor \" , \"status.trafficLightState \" ) se mapearon con el estado de administrador de la Junta ( \" THrow \" / \" Takeout \" / errores de conexión).\nCódigo refactorizado: manejo de visitas, manejo de tiro (triple / toro) y lógica de tráfico se movió a módulos separados.",
        "pl": "Dodano punkty danych świateł drogowych (\"status.traffic LightColor\", \"status.traffic LightState\"), które zostały odwzorowane ze statusu zarządu (\"Throw\" / \"Takeout\" / błędy połączeń).\nZmieniony kod: obsługa odwiedzin, obsługa rzutów (potrójny / byk) i logika światła drogowego przeniesiona do oddzielnych modułów.",
        "uk": "Додано точки світла трафіку (`status.trafficLightColor`, `status.trafficLightState`) на карті Board Manager (`Throw` / `Takeout` / помилки підключення).\nРефакторний код: візитна обробка, кидання (стриптиз / бик) і логіка трафіку переходить на окремі модулі.",
        "zh-cn": "增加从董事会管理者身份绘制的交通灯数据点(`Status.trafficLightColor ' ,`Status.trafficLight Station ' ) (`扔'/`Takeout ' /连接错误).\n重构代码:访问处理,投掷处理(三重/公牛)和交通灯逻辑移动到单独的模块."
      },
      "0.2.2": {
        "en": "bugfix",
        "de": "fehlerbehebung",
        "ru": "исправление ошибок",
        "pt": "correção de erros",
        "nl": "bugfix",
        "fr": "correction du bug",
        "it": "bugfix",
        "es": "bugfix",
        "pl": "bugfix",
        "uk": "панчохи",
        "zh-cn": "错误修正"
      },
      "0.2.1": {
        "en": "Reset for triple and bullseye trigger added",
        "de": "Zurücksetzen für Triple und Bullseye Trigger hinzugefügt",
        "ru": "Сброс тройного и бычьего триггера добавлен",
        "pt": "Reiniciar para gatilho triplo e bullseye adicionado",
        "nl": "Reset voor drievoudige en bullseye trigger toegevoegd",
        "fr": "Réinitialiser pour triple et bullseye déclencheur ajouté",
        "it": "Reset per trigger triple e bullseye aggiunto",
        "es": "Reiniciar para triple y disparador de toros",
        "pl": "Reset dla triple i bulseye wyzwalacz dodany",
        "uk": "Зміщено переадресацію для тридцятого і буклесу",
        "zh-cn": "重置三重和牛眼触发器"
      },
      "0.2.0": {
        "en": "Added datapoint for bulls-hit\nAdded maximun triple-hit flag score\nUpdate config\nWarning in log cleared",
        "de": "Datenpunkt für Bullen-Hit hinzugefügt\nZusätzlich maximun triple-hit flag score\nUpdate config\nWarnung im Protokoll gelöscht",
        "ru": "Добавлена точка данных для быков-хит\nДобавлена тройная оценка Maximun\nОбновление конфигурации\nПредупреждение в журнале очищено",
        "pt": "Ponto de dados adicionado para bulls-hit\nPontuação da bandeira máxima de três hit\nActualizar a configuração\nAviso no log apagado",
        "nl": "Toegevoegd datapoint voor bulls-hit\nToegevoegd maximiun triple-hit vlag score\nConfiguratie bijwerken\nWaarschuwing in log gewist",
        "fr": "Ajout du point de données pour bulls-hit\nAjout de maximun triple-hit drapeau score\nMettre à jour la configuration\nAvertissement dans le journal effacé",
        "it": "Datapoint aggiunto per bulls-hit\nAggiunto maximun triple-hit flag punteggio\nAggiornamento configurazione\nAvviso in log sgomberato",
        "es": "Punto de datos añadido para los toros\nAgregado maximun triple marca de bandera\nActualizar configuración\nAdvertencia en el registro despejado",
        "pl": "Dodano punkt danych dla byków\nDodano wynik flagi maximun triplehit\nAktualizuj konfigurację\nOstrzeżenie w dzienniku wyczyszczonym",
        "uk": "Додано точку даних для биків-хіт\nДодано максимальний потрійний-hit прапорець бал\nНалаштування оновлення\nПопередження в журналі",
        "zh-cn": "给 bull- hit 添加数据点\n增加最大值的三重旗分\n更新配置\n清除日志中的警告"
      },
      "0.1.0": {
        "en": "Added datapoints for visit score, current dart score, triple-hit flag with configurable minimum score, and camera configuration (cam0–cam2).\nCleaned up adapter logic and internal polling/timing.\nUpdated translations.",
        "de": "Weitere Datenpunkte für Besuchscore, aktuelle Dart-Score, Tripel-hit-Flag mit konfigurierbaren minimalen Punktzahl und Kamerakonfiguration (cam0–cam2).\nAufgereinigte Adapterlogik und interne Abfrage/timing.\nAktualisierte Übersetzungen.",
        "ru": "Добавлены точки данных для оценки посещений, текущая оценка дарта, флаг тройного удара с настраиваемым минимальным баллом и конфигурация камеры (cam0-cam2).\nОчищена адаптерная логика и внутренний опрос/настройка.\nОбновленные переводы.",
        "pt": "Adicionados pontos de dados para a pontuação de visita, pontuação de dardo atual, bandeira de triplo hit com pontuação mínima configurável, e configuração da câmera (cam0–cam2).\nLimpei a lógica do adaptador e as pesquisas internas.\nTradução atualizada.",
        "nl": "Toegevoegd datapoints voor bezoek score, huidige dart score, triple-hit vlag met configureerbare minimum score, en camera configuratie (cam0.\nOpgeruimd adapter logica en interne peiling / timing.\nBijgewerkte vertalingen.",
        "fr": "Ajout de points de données pour le score de visite, le score de fléchette actuel, le drapeau triple-hit avec le score minimum configurable et la configuration de la caméra (cam0–cam2).\nNettoyer la logique de l'adaptateur et effectuer des sondages internes/timing.\nTraductions actualisées.",
        "it": "Aggiunti i datapoint per il punteggio di visita, il punteggio di freccette corrente, la bandiera a triplo punto con il punteggio minimo configurabile e la configurazione della fotocamera (cam0–cam2).\nPulito logica adattatore e polling/timing interno.\nTraduzione aggiornata.",
        "es": "Puntos de datos añadidos para la puntuación de la visita, puntaje del dardo actual, bandera triple con puntaje mínimo configurable, y configuración de la cámara (cam0–cam2).\nLógica del adaptador limpiado y polinización interna / estimulación.\nTraducciones actualizadas.",
        "pl": "Dodano punkty datapointowe dla wyniku odwiedzin, aktualny wynik dart, flagę trójuderzeniową z konfigurowalnym minimalnym wynikiem oraz konfigurację kamery (cam0- cam2).\nOczyszczona logika adaptera i wewnętrzny sondaż / czas.\nAktualizacja tłumaczeń.",
        "uk": "Додано точки даних для облікового запису, поточний запис dart, потрійний прапор з налаштуванням мінімального балу та конфігурації камери (cam0–cam2).\nЗнімання логіки адаптера та внутрішнього опитування / термінів.\nОновлені переклади.",
        "zh-cn": "添加了访问分数的数据点,当前飞镖分数,三重击旗可配置最小分数,以及相机配置(cam0–cam2).\n清理适配器逻辑和内部投票/计时.\n最新译名."
      },
      "0.0.14": {
        "en": "fix",
        "de": "fixieren",
        "ru": "исправлять",
        "pt": "corrigir",
        "nl": "fix",
        "fr": "correction",
        "it": "correzione",
        "es": "arregle",
        "pl": "fix",
        "uk": "фіксація",
        "zh-cn": "固定"
      }
    },
    "titleLang": {
      "en": "Autodarts Integration",
      "de": "Autodarts-Integration",
      "ru": "Интеграция Autodarts",
      "pt": "Integração com Autodarts",
      "nl": "AutoDART-integratie",
      "fr": "Intégration d'Autodarts",
      "it": "Integrazione Autodarts",
      "es": "Integración de Autodarts",
      "pl": "Integracja Autodarts",
      "uk": "Інтеграція з AutoDarts",
      "zh-cn": "Autodarts 集成"
    },
    "desc": {
      "en": "Connects the ioBroker to the local Autodarts Board Manager.\n\nProvides states and events for the current game, allowing to trigger lights, sounds, text-to-speech, or other automations.",
      "de": "Verbindet den ioBroker mit dem lokalen Autodarts Board Manager.\n\nBietet Zustände und Ereignisse für das aktuelle Spiel, wodurch Lichter, Töne, Text-zu-Sprache oder andere Automatisierungen ausgelöst werden können.",
      "ru": "Обеспечивает связь ioBroker с локальным менеджером досок Autodarts.\n\nПредоставляет состояния и события для текущей игры, позволяя запускать световые эффекты, звуки, преобразование текста в речь или другие автоматизированные действия.",
      "pt": "Conecta o ioBroker ao Gerenciador de Tabuleiro Autodarts local.\n\nFornece estados e eventos para o jogo atual, permitindo acionar luzes, sons, conversão de texto em fala ou outras automações.",
      "nl": "Verbindt de ioBroker met de lokale Autodarts Board Manager.\n\nBiedt statussen en gebeurtenissen voor het huidige spel, waardoor het mogelijk is om lichten, geluiden, tekst-naar-spraak of andere automatiseringen te activeren.",
      "fr": "Connecte l'ioBroker au gestionnaire de plateau Autodarts local.\n\nFournit les états et les événements du jeu en cours, permettant de déclencher des lumières, des sons, la synthèse vocale ou d'autres automatisations.",
      "it": "Collega ioBroker al gestore locale del tabellone Autodarts.\n\nFornisce stati ed eventi per il gioco in corso, consentendo di attivare luci, suoni, sintesi vocale o altre automazioni.",
      "es": "Conecta el ioBroker al administrador de tablero Autodarts local.\n\nProporciona estados y eventos para el juego actual, lo que permite activar luces, sonidos, texto a voz u otras automatizaciones.",
      "pl": "Łączy ioBroker z lokalnym menadżerem płyt Autodarts.\n\nZawiera stany i zdarzenia dla bieżącej gry, umożliwiając aktywację świateł, dźwięków, zamiany tekstu na mowę lub innych automatyzacji.",
      "uk": "Підключає ioBroker до локального менеджера дошки Autodarts.\n\nНадає стани та події для поточної гри, дозволяючи запускати світло, звуки, перетворення тексту в мовлення або інші автоматизації.",
      "zh-cn": "将 ioBroker 连接到本地 Autodarts 棋盘管理器。\n\n为当前游戏提供状态和事件，允许触发灯光、声音、文本转语音或其他自动化功能。"
    },
    "authors": [
      "skvarel <skvarel@inventwo.com>"
    ],
    "keywords": [
      "dart",
      "scoring",
      "game",
      "automations",
      "autodarts"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "autodarts.svg",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.autodarts/main/admin/autodarts.svg",
    "enabled": true,
    "loglevel": "info",
    "mode": "daemon",
    "tier": 3,
    "type": "protocols",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "eraseOnUpload": true,
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "host": "127.0.0.1",
    "port": 3180,
    "interval": 1000
  },
  "objects": [],
  "instanceObjects": []
}
