{
    "helps": "Ayuda y preguntas frecuentes",
    "host_ip": "Host/IP de Autodarts (Boardmanager)",
    "host_ip_help": "Dirección IP del administrador local de Autodarts Board.",
    "host_port": "Puerto Autodarts (Boardmanager)",
    "host_port_help": "Número de puerto del administrador local de Autodarts Boardmanager.",
    "intro_txt": "Ayuda y preguntas frecuentes.",
    "light_target": "ID de objetivo ligero",
    "light_target_brightness": "ID de brillo del objetivo LED",
    "light_target_color": "ID de color de objetivo LED",
    "light_target_help": "ID del objetivo de luz para controlar las luces a través de Autodarts (por ejemplo, 'light.dartring'). Déjelo vacío para desactivar el control de luces.",
    "light_txt": "Mapeo de control de iluminación (opcional)",
    "light_txt_desc": "Introduzca sus puntos de datos de iluminación en los objetos del adaptador.",
    "mappings": "Asignaciones de hardware",
    "options": "Opciones",
    "options_connection": "Opciones de conexión",
    "options_logic": "Opciones lógicas",
    "paypal_donate": "Donar con PayPal",
    "polling": "Intervalo(s) de sondeo",
    "polling_help": "Intervalo de sondeo en segundos para recuperar datos del Autodarts Boardmanager.",
    "power_target": "ID de alimentación del objetivo LED",
    "power_target_help": "ID del objetivo de energía para controlar la energía a través de Autodarts (por ejemplo, 'switch.darts_socket'). Déjelo vacío para desactivar el control de energía.",
    "power_txt": "Mapeo de control de energía (opcional)",
    "power_txt_desc": "Introduzca sus puntos de datos de energía en los objetos del adaptador.",
    "reset": "Restablecimiento de disparador (s)",
    "reset_help": "Restablezca el disparador triple, doble, diana y fallido después de x segundos (0 = sin reinicio).",
    "tools_instance": "Número de instancia de Autodarts",
    "tools_instance_help": "0 para autodarts.0, 1 para autodarts.1, etc.",
    "tools_ip": "Dirección IP de ioBroker",
    "tools_ip_help": "IP o nombre de host donde se puede acceder a su adaptador ioBroker/simple-api.",
    "tools_port": "Puerto del adaptador simple-api",
    "tools_port_help": "Predeterminado: 8087",
    "tools_tab": "Integración de complementos de herramientas",
    "tools_urls_info": "Las URL de llamada final para Busted, Game on y Gameshot se pueden encontrar en los estados bajo autodarts.X.tools.config.* en el árbol de objetos.<br><br>Las URL luego se ingresan en la integración WLED (en el complemento del navegador)",
    "triple_flag": "Campo mínimo para el triple disparador",
    "triple_flag2": "Campo máximo para el triple disparador",
    "triple_flag2_help": "Campo de puntuación máxima para el triple disparador. Los dardos con una puntuación superior a este valor no activarán el punto de datos Triple-Trigger.",
    "triple_flag_help": "Campo de puntuación mínima para el triple disparador. Los dardos con una puntuación inferior a este valor no activarán el punto de datos Triple-Trigger.",
    "txt_one": "<b>Este adaptador conecta su Autodarts Board Manager local a ioBroker.</b><br><br>• Configure la conexión en OPCIONES (host, puerto, sondeo, rango triple).<br>• Asigne objetivos de luz y energía en MAPEO.<br>• Utilice los estados creados (tiros, semáforo, hardware) en sus visualizaciones, scripts y escenas.<br> • Vincule herramientas para Autodarts con el adaptador.",
    "txt_tools": "Esta pestaña configura la integración con la extensión del navegador “Herramientas para Autodarts”.<br><br>Para usarla, debe tener la extensión del navegador instalada y el adaptador ioBroker simple-api ejecutándose y accesible desde su navegador.",
    "txt_two": "... ¡más información próximamente!"
}
