{
    "helps": "Aide et FAQ",
    "host_ip": "Autodarts (Boardmanager) Hôte/IP",
    "host_ip_help": "Adresse IP de l'Autodarts Boardmanager local.",
    "host_port": "Port Autodarts (Boardmanager)",
    "host_port_help": "Numéro de port du Boardmanager Autodarts local.",
    "intro_txt": "Aide et FAQ.",
    "light_target": "ID de cible lumineuse",
    "light_target_brightness": "ID de luminosité cible LED",
    "light_target_color": "ID de couleur cible LED",
    "light_target_help": "ID de la cible lumineuse pour contrôler les lumières via Autodarts (par exemple, « light.dartring »). Laissez vide pour désactiver le contrôle de la lumière.",
    "light_txt": "Cartographie du contrôle de la lumière (facultatif)",
    "light_txt_desc": "Obtenez vos points de données d'éclairage dans les objets adaptateur.",
    "mappings": "Mappages matériels",
    "options": "Possibilités",
    "options_connection": "Options de connexion",
    "options_logic": "Options logiques",
    "paypal_donate": "Faites un don avec PayPal",
    "polling": "Intervalle(s) d'interrogation",
    "polling_help": "Intervalle d'interrogation en secondes pour récupérer les données de l'Autodarts Boardmanager.",
    "power_target": "ID de puissance cible LED",
    "power_target_help": "ID de la cible d'alimentation pour contrôler l'alimentation via Autodarts (par exemple, « switch.darts_socket »). Laissez vide pour désactiver le contrôle de l’alimentation.",
    "power_txt": "Cartographie du contrôle de puissance (facultatif)",
    "power_txt_desc": "Obtenez vos points de données d'alimentation dans les objets adaptateur.",
    "reset": "Déclencheur-Réinitialisation(s)",
    "reset_help": "Réinitialisez les déclencheurs triple, double, bullseye et miss après x secondes (0 = pas de réinitialisation).",
    "tools_instance": "Numéro d'instance Autodarts",
    "tools_instance_help": "0 pour autodarts.0, 1 pour autodarts.1, etc.",
    "tools_ip": "Adresse IP d'ioBroker",
    "tools_ip_help": "IP ou nom d'hôte où votre adaptateur ioBroker / simple-api est accessible.",
    "tools_port": "Port de l'adaptateur simple-api",
    "tools_port_help": "Par défaut : 8087",
    "tools_tab": "Intégration des modules complémentaires d'outils",
    "tools_urls_info": "Les URL d'appel finales pour Busted, Game on et Gameshot se trouvent dans les états sous autodarts.X.tools.config.* dans l'arborescence des objets.<br><br>Les URL sont ensuite saisies dans l'intégration WLED (dans le module complémentaire du navigateur).",
    "triple_flag": "Champ minimum pour le triple déclencheur",
    "triple_flag2": "Champ maximum pour le triple déclencheur",
    "triple_flag2_help": "Champ de score maximum pour le triple déclencheur. Les fléchettes avec un score supérieur à cette valeur ne déclencheront pas le point de données Triple-Trigger.",
    "triple_flag_help": "Champ de score minimum pour le triple déclencheur. Les fléchettes avec un score inférieur à cette valeur ne déclencheront pas le point de données Triple-Trigger.",
    "txt_one": "<b>Cet adaptateur connecte votre Autodarts Board Manager local à ioBroker.</b><br><br>1) Configurez la connexion sous OPTIONS (hôte, port, sondage, triple plage).<br>2) Cartographiez les cibles lumineuses et électriques sous MAPPINGS.<br>3) Utilisez les états créés (lancements, feux de circulation, matériel) dans vos visualisations, scripts et scènes.",
    "txt_tools": "Cet onglet configure l'intégration avec l'extension de navigateur « Outils pour Autodarts ».<br>Pour l'utiliser, vous devez avoir installé l'extension de navigateur et l'adaptateur simple-api ioBroker exécuté et accessible depuis votre navigateur.",
    "txt_two": "... plus d'informations à venir !"
}
