{
    "helps": "Aide et FAQ",
    "host_ip": "Autodarts (Boardmanager) Hôte/IP",
    "host_ip_help": "Adresse IP du Boardmanager Autodarts local.",
    "host_port": "Port Autodarts (Boardmanager)",
    "host_port_help": "Numéro de port du Boardmanager Autodarts local.",
    "intro_txt": "Aide et FAQ.",
    "light_target": "ID de cible lumineuse",
    "light_target_help": "ID de la cible lumineuse pour contrôler les lumières via Autodarts (par exemple, « light.living_room »). Laissez vide pour désactiver le contrôle de la lumière.",
    "light_txt": "Cartographie du contrôle de la lumière",
    "light_txt_desc": "Obtenez vos points de données d'éclairage dans les objets adaptateur.",
    "mappings": "Mappages",
    "options": "Possibilités",
    "options_connection": "Options de connexion",
    "options_logic": "Options logiques",
    "polling": "Intervalle(s) d'interrogation",
    "polling_help": "Intervalle d'interrogation en secondes pour récupérer les données de l'Autodarts Boardmanager.",
    "power_target": "ID de cible de puissance",
    "power_target_help": "ID de la cible d'alimentation pour contrôler l'alimentation via Autodarts (par exemple, « switch.darts_socket »). Laissez vide pour désactiver le contrôle de l’alimentation.",
    "power_txt": "Cartographie du contrôle de puissance",
    "power_txt_desc": "Obtenez vos points de données d'alimentation dans les objets adaptateur.",
    "reset": "Déclencheur-Réinitialisation(s)",
    "reset_help": "Réinitialisez les déclencheurs triple, double, bullseye et miss après x secondes (0 = pas de réinitialisation).",
    "triple_flag": "Champ minimum pour le triple déclencheur",
    "triple_flag2": "Champ maximum pour le triple déclencheur",
    "triple_flag2_help": "Champ de score maximum pour le triple déclencheur. Les fléchettes avec un score supérieur à cette valeur ne déclencheront pas le point de données Triple-Trigger.",
    "triple_flag_help": "Champ de score minimum pour le triple déclencheur. Les fléchettes avec un score inférieur à cette valeur ne déclencheront pas le point de données Triple-Trigger.",
    "txt_one": "Cet adaptateur connecte votre Autodarts Board Manager local à ioBroker.\n\n1) Configurez la connexion sous OPTIONS (hôte, port, polling, triple range).\n2) Cartographiez les cibles de lumière et de puissance sous CARTOGRAPHIES.\n3) Utilisez les états créés (lancements, feux de signalisation, matériel) dans vos visualisations, scripts et scènes.",
    "txt_two": "... plus d'informations à venir !"
}
