{
    "helps": "Ajuda e perguntas frequentes",
    "host_ip": "Host/IP do Autodarts (Boardmanager)",
    "host_ip_help": "Endereço IP do Autodarts Boardmanager local.",
    "host_port": "Porto Autodarts (Boardmanager)",
    "host_port_help": "Número da porta do Autodarts Boardmanager local.",
    "intro_txt": "Ajuda e perguntas frequentes.",
    "light_target": "ID do alvo claro",
    "light_target_brightness": "ID de brilho do alvo do LED",
    "light_target_color": "ID da cor do alvo do LED",
    "light_target_help": "ID do alvo de luz para controlar luzes via Autodarts (por exemplo, 'light.dartring'). Deixe em branco para desativar o controle de luz.",
    "light_txt": "Mapeamento de controle de luz (opcional)",
    "light_txt_desc": "Coloque seus pontos de dados de iluminação nos objetos do adaptador.",
    "mappings": "Mapeamentos",
    "options": "Opções",
    "options_connection": "Opções de conexão",
    "options_logic": "Opções lógicas",
    "polling": "Intervalo(s) de pesquisa",
    "polling_help": "Intervalo de pesquisa em segundos para recuperar dados do Autodarts Boardmanager.",
    "power_target": "ID de energia do alvo LED",
    "power_target_help": "ID do alvo de potência para controlar a potência por meio de Autodarts (por exemplo, 'switch.darts_socket'). Deixe em branco para desativar o controle de energia.",
    "power_txt": "Mapeamento de controle de energia (opcional)",
    "power_txt_desc": "Coloque seus pontos de dados de energia nos objetos do adaptador.",
    "reset": "Redefinição(ões) de gatilho",
    "reset_help": "Redefina o disparo triplo, duplo, alvo e erro após x segundos (0 = sem reinicialização).",
    "triple_flag": "Campo mínimo para o disparo triplo",
    "triple_flag2": "Campo máximo para o disparo triplo",
    "triple_flag2_help": "Campo de pontuação máxima para o disparo triplo. Dardos com pontuação acima deste valor não acionarão o ponto de dados Triple-Trigger.",
    "triple_flag_help": "Campo de pontuação mínima para o disparo triplo. Dardos com pontuação abaixo deste valor não acionarão o ponto de dados Triple-Trigger.",
    "txt_one": "Este adaptador conecta seu Autodarts Board Manager local ao ioBroker.\n\n1) Configure a conexão em OPÇÕES (host, porta, polling, intervalo triplo).\n2) Mapeie alvos de luz e energia em MAPEAMENTOS.\n3) Utilize os estados criados (throws, semáforos, hardware) em suas visualizações, scripts e cenas.",
    "txt_two": "... mais informações em breve!"
}
